{"article_title": "Alignment-Free Analyses of Nucleic Acid Sequences Using Graphical Representation (with Special Reference to Pandemic Bird Flu and Swine Flu)", "abstract": " The exponential growth in database of bio-molecular sequences have spawned many approaches towards storage, retrieval, classification and analyses requirements. Alignment-free techniques such as graphical representations and numerical characterisation (GRANCH) methods have enabled some detailed analyses of large sequences and found a number of different applications in the eukaryotic and prokaryotic domain. In particular, recalling the history of pandemic influenza in brief, we have followed the progress of viral infections such as bird flu of 1997 onwards and determined that the virus can spread conserved over space and time, that influenza virus can undergo fairly conspicuous recombination-like events in segmented genes, that certain segments of the neuraminidase and hemagglutinin surface proteins remain conserved and can be targeted for peptide vaccines. We recount in some detail a few of the representative GRANCH techniques to provide a glimpse of how these methods are used in formulating quantitative sequence descriptors to analyse DNA, RNA and protein sequences to derive meaningful results. Finally, we survey the surveillance techniques with a special reference to how the GRANCH techniques can be used for the purpose and recount the forecasts made of possible metamorphosis of pandemic bird flu to pandemic human infecting agents. ", "pub_name": "Synthetic Biology", "article_id_pmid": "", "article_id_pmc": "7121243", "article_id_doi": "10.1007/978-981-10-8693-9_9", "publisher_id": "9", "author_list": [["Nandy", "Ashesh", "Aff2"], ["De", "Antara", "Aff2"], ["Roy", "Proyasha", "Aff2"], ["Dutta", "Munna", "Aff3"], ["Roy", "Moumita", "Aff3"], ["Sen", "Dwaipayan", "Aff2"], ["Basak", "Subhash C.", "Aff4"]], "affiliation_list": [["Aff1", "grid.419235.8  Department of Pathogenesis and Cellular Response,   National Centre for Cell Science, Computational and Systems Biology Lab,   Pune, Maharashtra India"], ["Aff2", "Centre for Interdisciplinary Research and Education, Kolkata, India"], ["Aff3", "0000 0001 0664 9773  grid.59056.3f  Dinabandhu Andrews College,   Kolkata, India"], ["Aff4", "0000 0000 9540 9781  grid.266744.5  Department of Chemistry and Biochemistry,   University of Minnesota Duluth,   Duluth, MN USA"]], "issue_pub_year": "2018", "issue_pub_date": "02-10-2018", "keywords": "Article", "body_list": [{"section": "Introduction", "text": "Since the availability of large nucleic acid sequence data in the late 1980s, followed by the subsequent exponential growth of such data in the databases, the need for supportive tools to store, view, retrieve and analyse such sequences became and continues to be of urgent necessity. These tasks require methods to characterise the information contained in these sequences with a view to compare and contrast different sequences to determine their functions and place in the biological domain. The symbolic DNA sequence representation has been the legacy mainstay of such analyses carried over from the oligonucleotide sequence days, falling far short of the requirements of the broad sweeping overview of local and global base distributions, multiple sequence similarities and dissimilarities, molecular evolution and other studies necessary for an overarching assessment of the relationship of any DNA/RNA sequence to the biome through the accumulated data in the nucleic acid databases.\n      "}, {"section": "Introduction", "text": "Sequence alignment has been the primary tool of choice for such comparison of generic sequences. However, in the conventional methods, the time complexity of sequence alignment varies as ~O(l\n) for two sequence segments of length l (Kobori and Mizuta 2015). In the realm of genomic sequences, this clearly consumes an enormous amount of computation time, which grows even worse when multiple alignments are necessary. The reason behind such sequence alignment is the fact that mutational changes in nucleic acid sequences through individual nucleotide mutations and rearrangements in nucleotide distributions brought on by various biological processes are reflected in the DNA/RNA sequences we observe today. This constitutes one of the main considerations facing biologists trying to understand the variations between different sequences of the same genera and their evolution (Qi et al. 2011).\n      "}, {"section": "Introduction", "text": "Numerical characterisation of the DNA/RNA sequences is one of the main tools in undertaking this task, and a number of methods were developed to analyse specific attributes of DNA sequences. For example, the dot plot (Gibbs and McIntyre 1970) is used to visualise identical sequence segments between two proteins by the diagonal runs in a matrix of the constituents of the two sequences. Needleman and Wunsch (1970) used dynamic programming techniques to align protein or nucleotide sequences; another dynamic programming scheme was later proposed by Smith and Waterman (1981) (Smith et al. 1985), for improved scoring local sequence alignment, but the computational complexity and time requirements have limited its use. For protein secondary structure prediction, Chou and Fasman (1974a, b) developed an empirical technique, which, however, has been superseded by new machine learning techniques. In particular, dynamic programming techniques that analyse DNA sequences in terms of discrete small segments to eventually merge into the full sequence require time commitments of ~O(l\n), where k is the number of sequences to be aligned and is expensive in the use of computing resources, whereas fast Fourier transform (FFT) requiring resource time of ~O(l log l) is only slightly better (Hanson, thesis 2003). Multiple alignment fast Fourier transform (MAFFT) with a simplified scoring system to reduce the computational overhead (Katoh et al. 2002), discrete Fourier transforms (Yin et al. 2014) and wavelet transforms (Dodin et al. 2000) that displays regularity in patterns in DNA sequences have been some of the other methods deployed to extraction of information of interest from the DNA databanks. BLAST (Basic Local Alignment Search Tool) is one of the most popular search tools for local alignments; it uses a heuristic algorithm that takes shortcuts to identify, very rapidly, sequences in a library that most closely resemble the query sequence (Altschul et al. 1990, 1997).\n      "}, {"section": "Introduction", "text": "A more general approach that permits local and global sequence comparisons, generation of phylogenetic trees, numerical characterisations of DNA/RNA/protein sequences, quantitative estimation of sequence divergences and other properties and rational design of peptide vaccines is offered by novel, alignment-free schemes of graphical representation and numerical characterisation of biomolecular sequences (see review Nandy et al. 2006). The basic procedure in all these methods is to identify a vector with each type of nucleotide and plot each vector successively until the end of the sequence, thus drawing out a trajectory in the space of the model; associating a numerical value with the curve results in a descriptor of the sequence. This allows for quantitative comparisons between sequences and forms a powerful tool for analysis of similarities and dissimilarities between genes on a local and global scale. These novel approaches dispense with the need for alignments, which, for large sequences, become less reliable due to divergence of species and subsequent rearrangements (e.g. reversal, transposition or block exchange) occurring over evolutionary time scales; corrections introduced to take care of these divergences depend upon significant homologies between the sequences and the genes to be compared and thus become restrictive (Qi et al. 2011).\n      "}, {"section": "Introduction", "text": "However, as we discuss later, these alignment-free graphical representation methods are not without their problems either. One of these is related to computation of the sequence descriptors. In geometric approaches (Raychaudhury and Nandy 1999; Liao and Ding 2006; Bielinska-Waz et al. 2007), computational closure in limited time is possible; however, in some of the approaches where sequence descriptors are defined through matrices of distances between the bases or amino acids of the sequence (Randic et al. 2000a, b; Song and Tang 2005; Wang and Zhang 2006; Li et al. 2016; Randic et al. 2004; Bai and Wang 2006), generating a final value for large sequences remains a significant problem, and approximations have to be resorted too. In some instances, defining a suitable matrix to characterise and an invariant to associate with a gene sequence presents some difficulties (Qi et al. 2011).\n      "}, {"section": "Introduction", "text": "In this chapter, we present a concise summary of a selection of graphical representation methods to demonstrate the basics of this class of approaches of numerically characterising a biomolecular sequence. There have been a very large number of methodologies proposed to quantitatively estimate the differences between selected groups of genes and genomic sequences (see review Nandy et al. 2006). Extensions of these approaches have been made to take into account protein sequences (see review Randic et al. 2011) where the problem is compounded by the fact that the basic building blocks in protein sequences are constituted by 20 amino acids (Nandy et al. 2009) in comparison to nucleotide sequences where the basic building blocks constitute four bases; in terms of the methodologies, we consider a few in a short section and refer the readers to the original papers for greater details.\n      "}, {"section": "Introduction", "text": "These graphical representation methods are found ready for acceptance in research. The visual representation of base distribution in DNA sequences was used by Larionov et al. (2008) to compare the chromosomal DNAs of human and mouse to find several examples of palindromic runs in almost the same manner in the two species. Wiesner and Wiesnerova (2010), in an innovative application of 2D graphical techniques to multiallelic marker loci from Begonia x tuberhybrida Voss, suggested that the DNA walks could be correlated with genetic diversity to predict new allele-rich loci and improve new DNA germplasm identificators. Applications of the graphical representation and numerical characterisation techniques were made by Liao and his group (Liao et al. 2005, 2006) to analyse the genomic sequences of the viruses in SARS (severe acute respiratory syndrome) pandemic of 2003 and generate their phylogenetic relationship tree. Humberto Gonzalez-Diaz and his group applied the underlying concepts in an analysis of protein sequences for drug discovery research through numerical parameters analogously to quantitative structure-activity relationship (QSAR) topological indices (Estrada and Uriarte 2001; González-Díaz et al. 2007), determination of mass spectral data of proteins, toxicoproteomics, toxicity prediction and diagnosis of cancer patients (Cruz-Monteagudo et al. 2008; Gonzalez-Diaz et al. 2008a, b; Aguero-Chapin et al. 2009).\n      "}, {"section": "Introduction", "text": "In a number of interesting applications of the original 2D graphical representation of DNA/RNA sequences, one of the current authors of this chapter showed that introns and exons of mammalian genes differed significantly in base distribution characteristics (Nandy 1996a), that these properties can be used to determine coding regions in newly identified DNA sequences (Nandy 1996b) and that mutational changes in genetic sequences are guided by some restrictions which indicate an intricate relationship between intra-purine and intra-pyrimidine content of the sequences (Nandy 2009), among others.\n      "}, {"section": "Introduction", "text": "A number of applications have been made over the years of some of these graphical representation and numerical characterisation methods, molecular sequence similarity/dissimilarity and phylogenetic relationships being among the ones with the most abiding interest. For example, Randic et al. (2000a, b) and Liao and Ding (2006) used a novel 3D graphical representation model to examine the base distributions in the first exons of beta-globin genes of 11 species giving results that matched closely with those obtained by other graphical representation methods. In another approach, Zhang et al. (2010) used a spectral representation of DNA sequences defining a 24-component vector as sequence descriptor and illustrated their method using complete beta-globin sequences of seven species. Li et al. (2016) introduced a novel method of considering dinucleotides in a 3D graphical representation model and obtained phylogenetic trees of 4 datasets: the coding sequences of the beta-globin genes of 18 species, the mitochondrial cytochrome oxidase subunit I (COI) genes of 9 butterflies, the S segments of 32 hantaviruses (HVs) and 70 complete mitochondrial genomes, all of which gave evolutionary relationships that matched with standard data.\n      "}, {"section": "Introduction", "text": "In a slightly different application area, we refer in some detail to the applications of graphical representations and numerical characterisation schemes to viral genetics, focusing our attention more on the influenza virus in view of the several pandemics that it has caused, but we do mention in passing other viral pandemics also. It will be seen that some of the issues related to vaccine design and drug discovery are more easily and readily approached using graphical techniques, and these approaches with their visual representations also give fresh insights into base distribution and composition characteristics. These have led to determination of vaccine targets in the virions, tracking viral progress across geographical and time boundaries, computation of phylogenetic relationships and possible regulation of base composition and distribution in DNA/RNA sequences. Brief discussions of these applications and methods of surveillance of viral developments and progress are covered in another section of this chapter.\n    "}, {"section": "Graphical Representation and Numerical Characterisation (GRANCH)", "text": "Graphical representation and numerical characterisation (GRANCH) of nucleotide and amino acid sequences provides a very powerful tool for basic biological research. Mathematical descriptors based on graphical representations are used as a compact method for sequence comparison. The novelty, utility and low complexity of these representations have spawned a wide variety of approaches, some of which have seen many applications. A selection of such methods is given here in order to elucidate the many ways in which this technique can be formulated.\n      "}, {"section": "Graphical Representation and Numerical Characterisation (GRANCH)", "text": "While most applications to date have been done in graphical representations in 2D and 3D spaces, several authors (e.g. Tang et al. 2010) have proposed representations in higher orders of dimensionality. However, there are some advantages and disadvantages to them; in a 4D graphical representation of nucleic acid sequences, while overlaps and intersections of the sequence curve with itself can be avoided, graphical visualisation and the ability to directly compare two sequences are lost which, on the other hand, are easily achieved in 2D or 3D plots. Liao and Wang (2004) proposed a 6D representation, while Randic et al. (2005) suggested a novel four-colour map representation.\n      "}, {"section": "Graphical Representation and Numerical Characterisation (GRANCH)", "text": "Although graphical representation provides visual clues to the characteristics of base distribution in a sequence and enables visual comparison of similarities and dissimilarities between two or more sequences, quantitative estimation of such characteristics or differences between sequences is required for any significant comparisons. All authors of graphical representations have, therefore, recommended sequence descriptors to quantify sequence similarity/dissimilarity through the use of such descriptors. There are two approaches to define mathematical descriptors: geometrical and graph-theoretical methods.\n      "}, {"section": "Quantitative Estimation Methods", "text": "Various numerical descriptors for the numerical characterisation of sequences have been formulated during the past few decades. A particular descriptor maps the set of sequences (𝑆) into the set of real numbers (𝑅). In some cases, a vector may be extracted instead of a single number. Given below is a representative sample of the important and widely used descriptors known thus far. However, it should be noted that the list is not exhaustive.\n        "}, {"section": "Geometrical Methods", "text": "This method was first described by Raychaudhury and Nandy (1999), where they used the graphical representation of DNA sequence on a 2D rectangular grid, as explained below, using the (x, y) coordinate to derive the descriptor values. The first-order moments (μ\n, μ\n) and a graph radius g\n𝑅 are defined for each sequence as:where (x\n, y\n) are the coordinates of each point on the plot and N is the total number of bases in the segment. g\n𝑅 is the base distribution index which is dependent on the specific positions of the bases in a given sequence and has been found to be characteristic of the specific sequence base distributions. Thus, if two sequences yield the same g\n𝑅 value, the two sequences will be found to be identical for all practical purposes (Nandy and Nandy 2003). Now, if μ\n1 and μ\n2 refer to two different DNA sequences, then the quantity Δg\n𝑅 defined by:provides an estimation of the difference between the two sequences. Thus, g\n𝑅 and Δg\n𝑅 are very important measures of sequence composition and distribution.\n        "}, {"section": "Graph-Theoretical Methods", "text": "In this method, DNA/RNA sequence is represented and characterised by a two-step process: representation of the sequences using graphs and characterisation of the graphs by graph invariants. A graph invariant is a graph-theoretic property which is preserved by isomorphic graph (Harary 1969; Janežič et al. 2007). A graph 𝐺 is defined as an ordered pair consisting of two sets, 𝑉 and 𝐺=(𝑉(𝐺), 𝑅), where 𝑉(𝐺) represents a finite nonempty set of points and 𝑅 is a binary relation defined on the set 𝑉(𝐺). The elements of 𝑉 are called vertices, and the elements of 𝑅 also symbolised by 𝐸(𝐺) or 𝐸 are called edges. Such an abstract graph is commonly visualised by representing elements of 𝑉(𝐺) as points and by connecting each pair (𝑢, 𝑣) of elements of 𝑉(𝐺) with a line or edge if and only if (𝑢, 𝑣)ϵ R. The vertex, 𝑣, and edge, 𝑒, are incident with each other, as are 𝑢 and 𝑒. Two vertices in 𝐺 are called adjacent if (𝑢, 𝑣)ϵ R, i.e. they are connected by an edge. A walk of a graph is a sequence beginning and ending with vertices in which vertices and edges alternate and each edge is incident with vertices immediately preceding and following it. A walk of the form v\n, e\n, v\n, e\n, …, v\n joins vertices v\n and v\n. The length of a walk is the number of edges in the walk. A graph G is connected if every pair of its vertices is connected by a path. The distance (𝑢, 𝑣) between vertices 𝑢 and 𝑣 in G is the length of the shortest path connecting 𝑢 and 𝑣.\n          "}, {"section": "Graph-Theoretical Methods", "text": "In a molecular graph corresponding to DNA/RNA sequences, V represents the set of nucleic acid bases (A, T/U, G, C) and E represents the set of bonds connecting the adjacent bases. For any pair of bases (i, j) in the sequence, (i, j)ϵ R, they are either connected (adjacent) or not. Such a graph may be represented by an adjacency matrix A= {α\n} where:\n          "}, {"section": "Graph-Theoretical Methods", "text": "\n\n\n          "}, {"section": "Graph-Theoretical Methods", "text": "Now the graph-theoretical distance (topological) DG and the Euclidean distance DE between the vertices are measured, and a particular type of matrix, DE/DG, is formed from which the leading eigenvalues are calculated. The leading eigenvalue is used to characterise a sequence, while the difference between the eigenvalues forms an estimate of the similarity/dissimilarity between the sequences. Thus, the leading eigenvalues of DE/DG matrix and the associated eigen matrices are considered to be descriptors of the DNA sequences.\n          "}, {"section": "Graph-Theoretical Methods", "text": "To clarify the process of graphical representations and the differences between the multiple approaches, a short sequence of 10 bases, ATGAACACTC, is used as a standard example to generate plots using each of the methods mentioned here. The sequence denotes the stretch of first ten bases of the fourth segment of the influenza genome and the hemagglutinin (HA) gene, belonging to influenza A virus (A/Shenzhen/SP139/2014(H7N9)).\n        "}, {"section": "2D Rectangular Plot", "text": "A simple 2D Cartesian coordinate system is used to represent the nucleic acid sequences. Gates (1986), Nandy (1994) and Leong and Morgenthaler (1995) independently proposed the four cardinal directions on a 2D grid to represent the four bases. According to Nandy, starting from the origin, a point is plotted by moving one step in negative x-direction if the base is an adenine (A) and in the opposite direction if the base is a guanine (G) and a walk of one step in positive y-direction if the base is a cytosine (C) and in the opposite direction if it is a thymine (T) (or uracil, U). Plotting the points successively in this manner draws a graph of the sequence of bases. Gates and Leong and Morgenthaler proposed a similar graphical representation but with different assignments of the bases to the cardinal directions. The graph according to the Nandy prescription is given in Fig. 9.1.\n\n            "}, {"section": "", "text": "Nandy plot of ATGAACACTC\n"}, {"section": "2D Rectangular Plot", "text": "Table 9.1 represents the coordinates, the centre of mass of all the points and the graph radius g\n of the sequence as described in Sect. 9.2.1.1 (Raychaudhury and Nandy 1999).\n\n          "}, {"section": "", "text": "The co-ordinates, the centre of mass of all the points, and the graph radius g\n of the sequence as per Nandy rectangular plot"}, {"section": "Yau Plot", "text": "Although the 2D rectangular plots use a simple technique to easily visualise the sequence, it involves visual degeneracy that leads to an apparent loss of genetic information where repeated sequences, such as GAGAGAGAGAG, show overlapping paths. To overcome this, several authors proposed different modifications to the method which would reduce degeneracy (see review Nandy et al. 2006\n). Yau et al. (2003) proposed using two quadrants instead of four; cytosine (C) and thymine (T) are assigned to the first quadrant and adenine (A) and guanine (G) to the second quadrant, with the coordinates of the four bases defined as  for A, for G, for C and  for T (Fig. 9.2\n).\n\n            "}, {"section": "", "text": "Yau plot coordinate system and the graph of the sample sequence ATGAACACTC"}, {"section": "Yau Plot", "text": "While they did not prescribe a precise method for computing descriptors for the plots arising from their graphical method, we can, analogously to the Raychaudhury and Nandy (1999) method, define a centre of mass and a graph radius as descriptors. The results for our sequence in the Yau et al. (2006) plot are given in Table 9.2.\n\n          "}, {"section": "", "text": "The co-ordinates, centre of mass of all points and the graph radius as per the Yau et al plot"}, {"section": "Randic 2D Plot", "text": "There are many 2D approaches which do not involve the Cartesian coordinate system to represent nucleic acid sequence. Randic et al. (2003) proposed four horizontal equidistant parallel lines labelled as A, T, G and C from top to bottom. To plot the nucleic acid sequence, the bases are labelled along the x-axis, and straight lines are drawn from individual points on the four parallel lines according to the bases occurring in the sequence (Fig. 9.3).\n\n            "}, {"section": "", "text": "Randic 2D plot for the sequence ATGAACACTC"}, {"section": "Randic 2D Plot", "text": "A matrix method is used for determining a descriptor by constructing an M/M matrix for the given sequence ATGAACACTC. The off-diagonal entries of the M/M matrix are determined by dividing the Euclidean distance between two vertices of the zigzag curve by the graph-theoretical distance, i.e. the number of edges, between the two vertices. Here, if we take the first base A and the sixth base C of our sequence as an example, then the corresponding matrix element is obtained by taking the ratio of Euclidian distance between the first base (A) and the sixth base (C), i.e. , to the number of edges between A and C, which is 5 here. Proceeding in this way, we obtain the M/M matrix elements as shown below and the leading eigenvalue as the descriptor of the sequence (Tables 9.3, 9.4 and 9.5).\n\n\n\n            "}, {"section": "", "text": "The DE matrix in Randic 2D model"}, {"section": "", "text": "The DG matrix in Randic 2D model"}, {"section": "", "text": "The M/M matrix in Randic 2D model"}, {"section": "Randic 2D Plot", "text": "The leading eigenvalue in this case turns out to be 12.2388.\n          "}, {"section": "Song-Tang Plot", "text": "In a slight variation, Song and Tang (2005) proposed a three-horizontal line method where the central line represents two bases and the two peripheral lines denote each of the remaining bases. Counting of the nucleotides is done along the x-axis, and the bases are plotted and connected by straight lines as in the case of the Randic 2D plot. In the case of DNA primary sequences, the four bases A, C, G and T can be grouped as per their characteristics:\n\n            "}, {"section": "", "text": "Purine R = (A, G) and pyrimidine Y = (C, T)"}, {"section": "", "text": "Amino M = (A, C) and keto K = (G, T)"}, {"section": "", "text": "Weak H-bond W = (A, T) and strong H-bond S = (C, G)"}, {"section": "Song-Tang Plot", "text": "Keeping one of such groups, such as purine, as central line, and cytosine (C) and thymine (T) as the peripheral lines, we can plot a graph. Repeating the same process for the other groups, we get a total of six (4C2) combinations of plots. For each of them, the two peripheral lines can also be exchanged. In total, 12 (6×2) plots can be obtained.\n            "}, {"section": "Song-Tang Plot", "text": "In one such graph, where cytosine (C) and thymine (T) are assigned to the central line, adenine (A) to the uppermost line and guanine (G) to the lowermost line, the plot for the sequence ATGAACACTC is shown in Fig. 9.4.\n\n            "}, {"section": "", "text": "One plot as per Song and Tang’s representation of the sequence ATGAACACTC"}, {"section": "Song-Tang Plot", "text": "Here, the matrix elements and the descriptor are obtained by using the Randic 2D approach as discussed earlier. Like in the Randic 2D plot, two new matrix relations, as defined below, M/M and L/L, are constructed. The leading eigenvalues are calculated from the M/M and L/L matrices which form descriptors of the corresponding DNA sequence. The matrix elements are formed as follows:\nwhere ED, GD and PD are the Euclidian distance matrix, graph-theoretical distance matrix and path distance matrix, respectively (Tables 9.6 and 9.7).\n\n\n            "}, {"section": "", "text": "M/M matrix"}, {"section": "", "text": "L/L matrix"}, {"section": "Song-Tang Plot", "text": "The leading eigenvalue value in this case turns out to be 10.0552.\n            "}, {"section": "Song-Tang Plot", "text": "In this method the leading eigenvalues of M/M and L/L matrices are used as DNA descriptors. These numerical parameters will facilitate the comparison of two DNA sequences. A vector can be constructed to characterise a DNA sequence from these data obtained from different characteristic curves. For example, if we consider only L/L matrix and since two symmetrical characteristic curves have the same L/L matrices, we can construct a six-component vector as a DNA descriptor by using the leading eigenvalues of these matrices associated with six characteristic curves.\n          "}, {"section": "Wang-Zhang Plot", "text": "In the Wang-Zhang method (Wang and Zhang 2006), there are three configurations, namely, non-A, non-C and non-G. A binary method is employed where the presence or absence of bases in the sequence is assigned 0 and 1 according to the specific configuration, for example, 0 for A and 1 for the others if it is a non-A plot. A similar protocol is implemented for the non-C and non-G plots. The graphs for the sequence ATGAACACTC are shown in Fig. 9.5a–c.\n\n            "}, {"section": "", "text": "(a) Non-A, (b) non-C and (c) non-G"}, {"section": "Wang-Zhang Plot", "text": "In this model, the L/L matrices are constructed first from the three 2D graphs shown in Fig. 9.5 as a typical example to characterise the DNA sequence. Then the eigenvalues are computed from the matrices, and lastly, λnon-N are calculated which is λnon-N = maxeig (maximal eigenvalue) + mineig (minimal eigenvalue), where N = A, G, C. Proceeding in the same way, we obtain Table 9.8 for our sequence ATGAACACTC with the leading eigenvalues tabulated.\n\n          "}, {"section": "", "text": "The co-ordinates and the leading eigenvalues calculated as per the Wang-Zhang model"}, {"section": "", "text": "Non-A = 0.3201"}, {"section": "", "text": "Non-C = 2.1605"}, {"section": "", "text": "Non-G = 4.1949"}, {"section": "Yu-Hua Yao, Xu-Ying Nan and Tian-Ming Wang Plot", "text": "Yao et al. (2006) proposed a new 2D graphical representation of sequences, grouped as defined in section “Song-Tang plot”, viz. W-S, M-K and R-Y. Here, we have plotted our sequence ATGAACACTC based on their system where the coordinates for the three curves are:\n\n            "}, {"section": "Yu-Hua Yao, Xu-Ying Nan and Tian-Ming Wang Plot", "text": "The degeneracy is completely avoided in such representations. For our sample sequence, we get the plots as shown in Fig. 9.6a–c.\n\n            "}, {"section": "", "text": "(a) W-S curve, (b) M-K curve, (c) R-Y curve"}, {"section": "Yu-Hua Yao, Xu-Ying Nan and Tian-Ming Wang Plot", "text": "In this method, two sets of DNA descriptors are obtained. One is graph radius, subtending an angle θ with the x-axis, and the other is relative departure ρ which represents the difference between contents of bases of strong H-bonds and weak H-bonds in DNA sequence. Taking W-S curve as an example, the bisector is 50%(A, T)−50%𝑆(G, C) line. A mean distance between the points in the DNA curve and this bisector is the new descriptor (Tables 9.9, 9.10 and 9.11):\n\n\n\n\n          "}, {"section": "", "text": "W-S curve"}, {"section": "", "text": "The value of ρ for W-S curve = 1.4849"}, {"section": "", "text": "M-K curve"}, {"section": "", "text": "The value of ρ for M-K curve = 1.3435"}, {"section": "", "text": "R-Y curve"}, {"section": "", "text": "The value of ρ for R-Y curve = 1.0607"}, {"section": "Li and Ji TB Curve", "text": "In the 2D graphical method reported by Ji and Li (2006), let X=X\n1X\n2…X\n be a DNA primary sequence with n bases, and define a homomorphic map φ\n1 by φ\n1(X) = φ\n1(X\n1)φ\n1(X\n2)…φ\n1(X\n) as:\nwhere R\n (Y\n) is the cumulative occurrence of the numbers of bases ϵ R(Y) in the first i bases. The DNA sequence is mapped into a series of nodes P\n\n′s. Connecting the adjacent nodes, an R-Y curve is obtained. In a similar fashion, the other two maps are defined, and the M-K and W-S-TB curves for the sequence ATGAACACTC are obtained (Fig. 9.7a–c).\n\n            "}, {"section": "", "text": "(a) R-Y curve, (b) M-K curve, (c) W-S curve"}, {"section": "Li and Ji TB Curve", "text": "Here, three matrices, namely, ED matrix, M/M matrix and L/L matrix, are formed as before from which the leading eigenvalues are calculated. These are the descriptors of the corresponding DNA sequence. The formation of the matrix elements has already been discussed in section “Song-Tang plot” (Tables 9.12, 9.13 and 9.14).\n\n\n\n          "}, {"section": "", "text": "ED matrix"}, {"section": "", "text": "M/M matrix"}, {"section": "", "text": "L/L matrix"}, {"section": "Zhao, Qi and Yang 2D Plot (Based on Nucleotide Triplets)", "text": "Zhao et al. (2015) proposed a 2D graphical representation method on the basis of nucleotide triplets (codons), as opposed to individual bases, in the DNA coding sequence strand. There are 64 codons including the 3 termination codons. Let S = s\n1s\n2…s\n represent a random DNA sequence. On the basis of standard genetic codes, each codon in the sequence can be defined with the aid of a mapping ɸ:where i = i\n is the base of sequence S. Applying this technique to our sequence ATGAACACTC, the resulting plot set is {(1, 1), (2, 0), (3, 8), (4, 4), (5, 17), (6, 11), (7, 17), (8, 12)}, which gives a 2D curve termed as the considering codon degeneracy curve or CCD curve (Fig. 9.8).\n\n            "}, {"section": "", "text": "CCD curve of the sequence ATGAACACTC using the method proposed by Zhao et al. (2015)"}, {"section": "Zhao, Qi and Yang 2D Plot (Based on Nucleotide Triplets)", "text": "Here the CCD curve is associated with a 21-dimensional characteristic vector V.where the parameters n\n1, n\n2, …, n\n20 indicate the sequential trinucleotides of the mapping ɸ, respectively. For example, for the formula:\nv\n2 is the summation of the y-coordinate in the CCD curve which equals to 2. The n\n2 denotes the number of the trinucleotides, GCT, GCC, GCA and GCG. Extending the characteristic vector V, they propose two characteristic vectors V\n and V\n for an evolutionary distance computing scheme whose formula is:\n\n            "}, {"section": "Zhao, Qi and Yang 2D Plot (Based on Nucleotide Triplets)", "text": "The distance of two CCD curves is represented by the distance D(V\n, V\n) of two vectors, V\n and V\n, which can be used to quantify the evolutionary distance between sequences S\n and S\n. The two DNA sequences would be relatively similar if the D(V\n, V\n) was small. The smaller the distance, the more similar (relatively) are the two sequences.\n            "}, {"section": "Zhao, Qi and Yang 2D Plot (Based on Nucleotide Triplets)", "text": "For our sample sequence ATGAACACTC, the descriptor, vector V\n, can be defined as:whereas, for another sequence, ATGGTGCACC, the descriptor, V\n, is:The distance can then be computed as:\n\n            "}, {"section": "Zhao, Qi and Yang 2D Plot (Based on Nucleotide Triplets)", "text": "The small distance value implies that the two sequences are relatively similar.\n          "}, {"section": "Randic 3D Plot", "text": "\nThe 3D graphical representation of DNA sequence was proposed by Randic et al. (2000). They associated the 2D method with a 3D graph by assigning each of the four bases to the corners of a tetrahedron where the points are as follows: (+1, −1, −1) for A, (−1, +1, −1) for G, (−1, −1, +1) for C and (+1, +1, +1) for T. The graph is plotted by placing the first base say A (for our mini sequence ATGAACACTC) at the corner position, i.e. at (+1, −1, −1), and the next base, i.e. T at (2, 0, 0). Proceeding in this manner, we obtain a plot of the sequence ATGAACACTC as shown in Fig. 9.9.\n\n            "}, {"section": "", "text": "3D plot as per Randic et al.’s representation of the sequence ATGAACACTC"}, {"section": "Randic 3D Plot", "text": "In this graphical plot of our mini sequence ATGAACACTC, a DE/DG matrix (from the Euclidean pairwise distance matrix DE and a pairwise graph-theoretical distance matrix DG of all the points on the graph) is constructed from which the leading eigenvalues are calculated to evaluate the descriptor of the sequence. In the following table, the coordinates of the bases of the sequence and the elements of the DE/DG matrix constructed from these coordinates are shown. Each matrix element is calculated as follows: Taking the (1,6) element, i.e. the first base A to the sixth base C as an example, the Euclidian distance is calculated from the coordinates shown in Table 9.15 and is divided by the minimum distance between two consecutive points which is √3. The division by the minimum distance is performed in order to normalise the distance scale, so that the Euclidian distance between adjacent vertices equals 1 and not √3 (due to taking the side of the cube to be 1). Now this value is divided by the number of edges before the sixth base, i.e. 5 here. Thus, the value obtained is = (√3/√3)/5 = 0.200 (Table 9.16).\n\n\n            "}, {"section": "", "text": "The co-ordinates as per Randic 3D plot"}, {"section": "", "text": "DE/DG matrix in Randic 3D model"}, {"section": "Randic 3D Plot", "text": "The descriptor value, i.e. the leading eigenvalue, in the Randic 3D model for this sequence is 5.38566.\n          "}, {"section": "Li et al. 3D Plot", "text": "A novel 3D representation of DNA sequences was proposed by Li et al. (2016). If the bases are represented by a set {A, G, C, T}, they graphically characterised a sequence in terms of nucleotide pairs by taking two combinations of the set in terms of a multiset {∞. A, ∞. G, ∞. C, ∞. T}. The possible number of such pairs can be ten (Table 9.17).\n\n            "}, {"section": "", "text": "Two combinations of multiset {∞. A, ∞. G, ∞. C, ∞. T}"}, {"section": "Li et al. 3D Plot", "text": "Let V be a tetrahedron with its centre represented by O(0, 0, 0). The bases A, C, G and T are plotted at the vertices V\n1(1, 1, 1),  V\n2(−1,   − 1,  1), V\n3(1,   − 1,   − 1) and V\n4(−1,  1,   − 1), respectively. For all the line segments formed between each pair of vertices, a midpoint is regarded as follows:\n\n            "}, {"section": "", "text": "\nM is the midpoint of AC."}, {"section": "", "text": "\nK is the midpoint of GT."}, {"section": "", "text": "\nR is the midpoint of AG."}, {"section": "", "text": "\nY is the midpoint of CT."}, {"section": "", "text": "\nW is the midpoint of AT."}, {"section": "", "text": "\nS is the midpoint of CG."}, {"section": "Li et al. 3D Plot", "text": "Ten directions  are obtained from which ten-unit vectors are produced as:\n            "}, {"section": "Li et al. 3D Plot", "text": "\nThey associated each of the two combinations with the ten-unit vectors as:\n\n            "}, {"section": "Li et al. 3D Plot", "text": "To plot our sequence ATGAACACTC with this method, we take two nucleotides at a time. Commencing from the origin, we move to the first dinucleotide AT, r\n and arrive at P\n1, the first point on the 3D curve. Proceeding from P\n1, we move towards the dinucleotide TG, r\n and reach the second point P\n2. Progressing in this manner (Table 9.18), we get the curve as shown in Fig. 9.10.\n\n\n            "}, {"section": "", "text": "The co-ordinates of the Li et al 3D plot"}, {"section": "", "text": "3D dinucleotide plot method of Li et al. of the sequence ATGAACACTC"}, {"section": "Li et al. 3D Plot", "text": "A common way to find the descriptor of DNA/RNA sequence is to construct a matrix from which the leading eigenvalue is calculated that serves as a descriptor for that sequence. But in this method, a different technique is introduced to calculate the DNA descriptor which is called ‘piecewise function’. A 3D representation having n vertices, in order of their appearance in the curve, is partitioned into K parts; each part is termed as a cell. Therefore, the i\n cell:where U\n0 = (0, 0, 0)\n            "}, {"section": "Li et al. 3D Plot", "text": "A DNA sequence can be numerically characterised by a 3K dimension vector V\n:which in the case of our sample sequence will be:Now, for any two sequences S\n, S\n, if their descriptor values are a = (a\n1, a\n2, …, a\n3) and b = (b\n1, b\n2, …, b\n3),respectively, their similarity can be calculated by the Euclidean distance given by:whereby, the smaller the d(a, b), the more similar are the two DNA sequences.\n          "}, {"section": "Comparative Study of Results from Different Graphical Methods", "text": "The following table contains the list of values of the descriptors prescribed for each of the methods described above for comparative study based on the coding sequences of four human globin genes. Some of the result sets had to be trimmed to accommodate in the list. Brief descriptions are given below for the results listed of some of the methods to understand the computation.\n\n        "}, {"section": "", "text": "\nYao-Nan-Wang plot (section “Yu-Hua Yao, Xu-Ying Nan and Tian-Ming Wang plot”): Three curves had been proposed as part of this method (i.e. RY, MK and WS). Ideally each curve is described by a 3D vector (of θ, gR and ρ), among which only the results for the WS curve have been listed."}, {"section": "", "text": "\nLi-Ji plot (section “Li and Ji TB curve”): The method proposes three curves the same as in Yao-Nan-Wang one. Only the leading eigenvalues for the L/L matrices corresponding to the RY family are shown in here."}, {"section": "", "text": "\nZhao-Qi-Yang plot (section “Zhao Qi Yang 2D plot (based on nucleotide triplets)”): The method proposes a 21-dimensional vector, of which the 0th set, given no weight, always ends up with a value of zero. Thus, it can be considered as a 20-dimensional vector, effectively. Values for only positions 1st, 2nd, 19th and 20th are listed for representational purpose."}, {"section": "", "text": "\nLi et al. plot (section “Li et al. 3D plot”): This method prescribes a unique descriptor using ‘piecewise function’. It depends mainly on the average number of bases per sequence in a given dataset (in our case, this is 440.25) and a factor ‘k’ (logarithmically dependent on the aforementioned ‘average’ factor, which is ~4 in our case,). As per the proposed representation, the length of the representative vectors for our dataset would have been 12 for each sequence. Hence, for the sake of simplicity and a biting space crunch in hand, we did away with the critical representation and presented the endpoints of the prescribed 3D curve as a numerical descriptor for each sequence instead (Table 9.19).\n\n"}, {"section": "", "text": "Sequence descriptors and sample parameters computed for four human globin genes for all the GRANCH methods discussed above"}, {"section": "Introduction", "text": "Graphical representation schemes for protein sequences came about as a natural consequence of the development and applications of graphical representations of nucleotide sequences. In contrast to that of nucleic acid sequences, graphical representation of protein sequences is complicated, given there are 20 amino acid residues as the basic units of proteins, while nucleic acids can be defined by only 4 bases. Initial efforts were made to portray the amino acids in terms of four properties so they could be represented in a 2D coordinate system like for the DNA sequences and later extended to multidimensional representations (see review Randic et al. 2011). We proceeded to simplify the representation intuitively by projecting the primary sequence in a 20-dimensional Euclidean space which can be used to understand the phylogenetic relationship, provide mutational insight and identify conserved regions for groups of proteins. We briefly mention just this one method in this chapter on nucleic acid research for completeness.\n        "}, {"section": "Design of the 20D Graphical Representation Algorithm", "text": "A 20-dimensional Cartesian coordinate system is used to model the protein sequences. The 20 amino acids are assigned to 20 axes in the Cartesian framework (Nandy et al. 2009); all the axes are equivalent, and the choice of association of amino acids with the axes can be made arbitrarily but once made will remain constant for the duration of the exercise. The computation starts from the origin and moves a step in the appropriate axis direction for the first amino acid in the sequence, another step in the respective axial direction for the next amino acid in the sequence and so on. Tracing the path for the occurrences of all the amino acids in the sequence in order results in a series of points in the abstract 20D space generating a 20D curve. An index for the protein sequence can be considered as a vector from the origin of the coordinate system to the endpoint of the graph. In order to eliminate the disadvantage that different distributions of the residues with the same composition in the sequences will lead to degeneracy in these vectors, the algorithm is designed to choose the characteristics of a sequence by a weighted centre of mass approach, first used for DNA sequence (Raychaudhury and Nandy 1999) and defined by:\n          "}, {"section": "Design of the 20D Graphical Representation Algorithm", "text": "\nwhere the x\n′s are the coordinate values of each point on the curve and N, a normalisation factor for the μ\ns, is the number of amino acids in the protein sequence. Using these weighted averages, a protein graph vector and a protein graph radius p\n can be obtained:\n          "}, {"section": "Design of the 20D Graphical Representation Algorithm", "text": "\nIdentical protein sequences have the same p\n values, which change with any alteration in the amino acid composition and distribution in the sequence. Δp\n is used to compare the differences between two protein sequences quantitatively as the Euclidean distance between two protein graph radii:\n\n          "}, {"section": "Design of the 20D Graphical Representation Algorithm", "text": "For multiple sequences, this method allows the comparison of pairwise differences, irrespective of sequence lengths. Thus, it can generate a distance matrix that could be used to construct phylogenetic trees, the advantage being that it does not require any multiple sequence alignments nor make any other model-dependent assumptions (Nandy 2009).\n          "}, {"section": "Design of the 20D Graphical Representation Algorithm", "text": "The 20D algorithms have been applied in phylogenetic analysis (Nandy 2009), mutational analysis of protein sequences on conserved surface accessible regions and drug target finding in influenza neuraminidase (Ghosh et al. 2010), rotavirus VP7 (Ghosh et al. 2012), Zika virus (Dey et al. 2017a) and others (Dey et al. 2016).\n        "}, {"section": "Applications of the New Methodology", "text": "We have briefly recounted in the introduction the various applications that have been made of alignment-free comparisons of DNA/RNA/protein sequences using the new methodology of graphical representation and numerical characterisation techniques. An area of particular concern that has seen many applications has been viral pandemics; specifically, in the twenty-first century, successive waves of epidemics and pandemics have swept across the globe starting with SARS (severe acute respiratory syndrome) pandemic of 2002–2003 that killed over 8000 people, the swine flu of 2009 (>100,000 deaths), the Ebola epidemic of 2014–2016 in West Africa (over 15,000 deaths) and the Zika virus pandemic that struck the Americas in 2015–2017 (>200,000 deaths). Understanding the characteristics of the viral spread and genetics would thus appear of urgent necessity. In this section we concentrate on the influenza pandemics as one of the most virulent killer diseases and summarise some of the specific applications of graphical representation methods to understand the character of the influenza virus, especially in relation to the pandemic varieties.\n      "}, {"section": "A Brief History of Flu Epidemiology", "text": "Viral outbreaks and epidemics have been recorded in historical archives from as far back as 400 BCE (Martin and Martin-Granel 2006). There have been written records of influenza outbreaks since the fifteenth century. The first cases of influenza in North America were possibly brought on by the European settlers in the late 1400s. The sixteenth century witnessed a flu pandemic spread from Russia to Europe via Africa (Pyle 1986), while England, Ireland and the USA were affected by three prominent outbreaks in the seventeenth century (Knobler et al. 2005).\n        "}, {"section": "A Brief History of Flu Epidemiology", "text": "The twentieth century saw one of the most horrific viral disasters of any era, viz. the 1918 ‘Spanish influenza’. This was a type A H1N1 virus that brought about an onslaught of worldwide pandemic, spreading to far corners of the world, including the Arctic and isolated islands in the Pacific (Mamelund 2011). By the end of the pandemic that had come in three waves between 1918 and 1919 (Taubenberger and Morens 2006), it had reportedly killed 50–100 million people (Patterson and Pyle 1991), mostly affecting the demographic age group of 20–40 years (Simonsen et al. 1998). During the peak of the pandemic in USA, more than 100,000 deaths were occurring in a week (Reid et al. 1999). It is interesting to note that post first infection wave, herd immunity within the population should have immunologically protected a second wave of infection in the same year. But on the contrary, the second wave drastically increased mortality rates. A key enigma, genetically, is the occurrence of the three infection waves in rapid succession within a period of 6–12 months: the H1N1 virus had to accumulate immense mutational changes or acquire key genetic alterations for it to become so fatal so rapidly which normally requires years of circulation within a population. However, in this case the virulence had increased over a matter of weeks (Reid et al. 1999).\n        "}, {"section": "A Brief History of Flu Epidemiology", "text": "Pandemics generally spread through trade routes when infected people travel or migrate from one country to another. The unprecedented proportions at which the Spanish influenza spread were only possible due to incidental military movements from one continent to the other for World War I (Erkoreka 2009).\n        "}, {"section": "A Brief History of Flu Epidemiology", "text": "This was followed by two more influenza epidemics in 1957 and 1968. The two viruses arose by reassortment of human and avian strains. The avian strain was from wild waterfowl found in Eurasia, and the human strain originated from the H1N1 strain that was already present in the population. It is speculated that the surface proteins of hemagglutinin and neuraminidase that had adapted to humans were replaced by those found in the avian strains (Reid et al. 2004). The 1957 epidemic, ‘Asian influenza’, originated in China and resulted in two million deaths caused by the type A H2N2 virus (Pyle 1986). The Asian flu virus next underwent antigenic shift to give rise to the H3N2 virus that brought about the 1968 ‘Hong Kong influenza’ epidemic; in a report one million people died from the viral infection (Knobler et al. 2005). Towards the end of the century, in 1996, H5N1 virus was identified in China in geese which subsequently jumped the species barrier to infect poultry; some humans were incidentally infected in the 1997 wave and caused serious concern of another pandemic (De Jong et al. 1997). In the next few years, the H5N1 avian flu spread across various countries around the world and millions of wild as well as poultry deaths were seen. Human deaths arising from this avian influenza through physical contact were recorded globally till early 2014, but till date no human-to-human transmission has been observed, fortunately.\n        "}, {"section": "A Brief History of Flu Epidemiology", "text": "The twenty-first century saw the most recent influenza pandemic in 2009. The H1N1(2009)pdm strain, known as the swine flu, started from Mexico and spread rapidly round the globe, leading to a death toll of 106,000–400,000 (Dawood et al. 2012), before it died down. In 2014–2015, the poultry industry in the USA was faced by an epidemic of H5N2 bird flu that is believed to have been a reassortment with Asian H5 and North American N2 proteins, which could mutate to a human-infecting pandemic although no human infection has been noticed to date (Nandy and Basak 2015). In 2017–2018, flu season in the USA, an H3N2 type A influenza epidemic has affected thousands of people and led to the death of around 140 children, once again underlining the high pathogenicity of the influenza virus.\n      "}, {"section": "Genetics of Influenza Virus", "text": "Influenza virus belongs to the Orthomyxoviridae family. They are of four types, A, B, C and D, referred to as IAV, IBV, ICV and IDV, respectively (CDC 2017a). Types A, B and C infect humans and a variety of animals, among which type A is the most virulent. Influenza D virus was identified as recently as 2012. Although, IDV has been found to infect cattle (Hause et al. 2014; WHO 2018a, b), its detection in swine has raised the possibility of its spread in other mammals, including humans. Wild aquatic birds are the natural reservoir of the influenza A virus. The bird flu scare of around 1997–2005 was noteworthy because of the rapidity with which the virus spread throughout the globe causing huge fatalities among birds and animals; it still continues to precipitate frequent outbreaks. Because of the worldwide spread, virulence and pandemic history, IAV is of primary importance among the four types. In this chapter, we emphasise only on influenza type A virus except where otherwise stated.\n        "}, {"section": "Genetics of Influenza Virus", "text": "Influenza is a negative-sense strand RNA virus. It is characterised by a segmented genome (Bouvier and Palese 2008) where the IAV has 8 segmented genes coding for 11 proteins, as described in Table 9.20. The influenza A virion is roughly spherical in shape, typically around 100 nanometres wide. It consists of an envelope containing the two surface proteins, hemagglutinin (HA) and neuraminidase (NA), in the proportion of 4:1 (Bouvier and Palese 2008). The central hollow core contains the RNA genome and the other proteins essential for packaging and survival of the virion.\n\n        "}, {"section": "", "text": "Gene segments of influenza A virus (A/duck/Vietnam/HU5-1571/2016(H5N1)) and their encoded proteins. While most proteins are coded by the gene segments, PB2-F1, M2 and NEP are expressed from spliced RNAs or alternate reading frames. (Based on the table in Bouvier and Palese 2008)"}, {"section": "Genetics of Influenza Virus", "text": "IAV is categorised into several subtypes based on their surface-exposed proteins HA and NA, such as H1N1, H3N2 and H5N1, among others. So far, 18 subtypes of HA and 11 subtypes of NA have been observed on the basis of their antigenicity (Tong et al. 2013), out of which only a few subtypes are found to infect humans (Nandy et al. 2014).\n        "}, {"section": "Genetics of Influenza Virus", "text": "HA mediates entry of the virus in the host cell by binding with terminal sialic acid residues of the host cell glycoprotein receptors. The HA protein has two subdomains, HA1 and HA2. HA1 subdomain contains the receptor-binding region and the antigenic regions where many mutations occur. HA2 subdomain is comparatively more stable and functions to anchor the protein on the viral envelope. NA mediates exit of the virus from the host cell by cleaving the terminal sialic acid residues of the glycoprotein or glycolipid receptors (Chen and Li 2013).\n        "}, {"section": "Genetics of Influenza Virus", "text": "The host cells primarily include epithelial cells of the nose, throat and lungs of mammals and intestines of birds. Following binding, the viral lipid membrane fuses with the host cell membrane. The terminal sialic acid residues of the human cell receptors, where the HA binds, are of two types, α-2-3 linked and α-2-6 linked, having differential distribution in the lower and upper respiratory tract of humans, respectively (Kumlin et al. 2008). Distribution of the α-2-3-linked and α-2-6-linked sialic acid receptors in swine respiratory tract is much more uniform. In contrast, birds have only α-2-3-linked sialic acid receptor in their respiratory tract. This atypical distribution of sialic-linked glycoprotein receptors in the animal kingdom plays a significant role in evolution and dissemination of the virus. In China and the Far East, where poultry and swine herds are raised in numerous villages and farms, avian influenza with α-2-3-linked sialic acid receptors can infect swine and develop the ability to bind α-2-6-linked sialic acid receptors. This enables the modified virus to infect humans in the upper respiratory tract and make transmission between humans easy through sneezing and coughing. The scare with the bird flu, H5N1, was for this particular possibility – the virus has a high mortality ratio but to date can infect humans only through the α-2-3-linked sialic acid receptors. Were it to develop the ability to bind the α-2-6 linked sialic acid receptors, humans would be susceptible to a pandemic catastrophe.\n        "}, {"section": "Genetics of Influenza Virus", "text": "In another instance, the Spanish flu of 1918, known to be of avian origin (De 2018), is believed to have mutated to two forms (Reid et al. 2003). During the pandemic, two strains of H1N1 virus was co-circulating in nature. One strain was capable of binding α-2-6-linked sialic acid receptors present in the upper respiratory tract, having mutations at amino acid positions 190 (E190D) and 225 (D225G) in the HA1 segment (Reid et al. 2003). The other had the potential to bind both α-2-6- and α-2-3-linked sialic acid receptors present in the upper respiratory tract and lower respiratory epithelial cells, with mutation only at amino acid position 190 (E190D) in the HA1 segment (Reid et al. 2003).\n        "}, {"section": "Genetics of Influenza Virus", "text": "RNA viruses are prone to very high rates of mutation (Barr and Fearns 2010; Drake 1993). The enzyme required for influenza gene replication in the host cell, RNA-dependent RNA polymerase, is devoid of any proofreading activity, which allows mutations during replication to be retained. Mutational changes in IAV are known to proceed by two well-documented mechanisms, antigenic drift and antigenic shift (CDC 2017b). Antigenic drifts arise out of random point mutations. If they occur in the viral antigenic site, the host cell may lose immunity against the virus, and the infection-immunity response cycle starts all over again. These drifts can cause seasonal outbreaks or epidemics, but they are not potent enough to give rise to pandemics. Antigenic shifts are less recurrent, occurring only when two or more virus subtypes infect a host cell. As the virus has segmented genome, the progeny virus may pack genes from different subtypes in a process known as reassortment. This may give rise to new and unique subtypes, sometimes introducing novel surface-exposed HA or NA that may predispose the viral host to high degree of pathogenesis. Antigenic shifts are often the causes of pandemics.\n        "}, {"section": "Genetics of Influenza Virus", "text": "Interestingly, the Spanish flu virus is believed to have had greater than expected number of silent nucleotide or synonymous mutations (mutations that do not change the corresponding amino acids) in its genome in comparison with its avian and mammalian counterparts (Morens et al. 2010) and caused other pandemics through reassortments: the H2N2 pandemic of 1957, the H3N2 pandemic of 1968 and the H1N1 pandemic of 2009. The H5N1 bird flu is believed to have been a reassortment of genes from a prior H5N1 and a H9N2. Similarly, the H7N9 avian flu that struck China in 2013 (Gao et al. 2013) was a reassorted virus, picking up genes from multiple hosts like HA genes from H7N3 virus of domestic duck, NA from H7N9 virus of wild migratory birds and six other genes from the H9N2 virus of domestic poultry (CDC 2013; Liu et al. 2013). In 2015, there was an avian epidemic in the poultry market in the Midwest USA caused by H5N2 virus (Spackman et al. 2016), another product of reassortment which held possibilities of further reassortants.\n        "}, {"section": "Genetics of Influenza Virus", "text": "There is also a third mechanism by which a virus may mutate to form a new strain. If a host cell is coinfected by two different strains of the same subtypes, the RNA polymerase may jump during replication from one RNA segment to its counterpart on the other strain at a consensus sequence of the gene referred to as a break point, continue replication and then revert to the original strain at the next break point. This phenomenon is termed as copy-choice recombination. This can give rise to progeny virus having a novel RNA segment not present in either of the infecting strains. We have also considered the possibility of the natural division of distinct segments of a gene, such as HA1 and HA2 of HA as break points, a topic we discuss in some detail later. Recombination in viruses is a controversial subject where the incidence of recombination through copy-choice method is expected to be below 2% (Hao 2011; Boni et al. 2012). However, a mechanism where whole segments of a gene are exchanged between two strains of the same subtype by polymerase jumps has occurred in about 5% of the cases examined (De and Nandy 2015).\n      "}, {"section": "Characterising the Flu Using Graphical Representation Methods", "text": "Quantitative sequence descriptors, like the g\n of the 2D rectangular representation, provide a ready means to follow the progress of typical viral strains across geographical and temporal domains. To this end we have investigated different aspects of the influenza virus. Some of these are briefly recounted below to indicate to the interested reader how such studies can be actually done.\n        "}, {"section": "Characterising the Flu Using Graphical Representation Methods", "text": "Considering the high morbidity and mortality among the avian population arising from infections with the H5N1 bird flu virus around the turn of the century and the serious concern over possible mutagenesis of the strain to a human-to-human-infecting one, we undertook detailed comparisons of the H5N1 strains’ neuraminidase sequences over a 10-year span to determine what changes were taking place (Nandy et al. 2007). Assuming that mutational changes in the sequences will be quantified by estimates of the graph radii, g\n, in a 2D graphical representation model (Nandy 1994), we assembled a database of 173 neuraminidase sequences for the years 1996–2005 and computed the average g\n values separately over periods when the flu was highly pathogenic to humans (1996–1997 and 2003–2005) and when less pathogenic (1998–2002). We found from computations of the g\n that, e.g. an H5N1 neuraminidase A/Chicken/Hong Kong/220/97(H5N1) had a very close similarity to another NA sequence from the same year, A/HongKong/156/97(H5N1), a result that matched with a conventional phylogenetic study by Suarez et al. (1998), whereas comparison with A/chicken/China/1/02-(H5N1)NA 5 years later showed that the two sequences were dissimilar almost seven times as much as the dissimilarity between the previous two sequences as estimated through Δg\n. This provides a descriptor-based insight into how rapidly the virus mutates over the years. A more detailed analysis with the g\n of the individual segments showed that the g\n expanded in the years of high pathogenicity to humans, more so for the period 2003–2005, whereas the period of low pathogenicity showed reduced values of g\n. This indicates a relative increase in the A, T component of the neuraminidase gene sequences in the pathogenic years, which could be a contributor to the high pathogenicity observed (Nandy et al. 2007).\n        "}, {"section": "Characterising the Flu Using Graphical Representation Methods", "text": "A study of mutational changes in influenza strains such as of H5N1, H1N1, etc. is important for surveillance against the influenza subtypes building up resistance against the therapeutics and vaccines. Studying a group of 682 strains of the H5N1 virus over the years 1997–2008 (Ghosh et al. 2009), we came across an interesting phenomenon: How far a strain had travelled geographically and temporally. Considering the property that the same g\n of two sequences implies very close similarity of sequences (Nandy and Nandy 2003), we found that identical sequences have appeared over significant distances in space and time, raising questions about a virus’ longevity. Based on the statistics, we found it compelling to hypothesise that virions could probably survive ex vivo (Ghosh et al. 2009, but also see Bean et al. 1982) in dried mud or dirt carried over long distances by wild birds to infect other birds and poultry in wetlands in distant areas.\n        "}, {"section": "Characterising the Flu Using Graphical Representation Methods", "text": "The same investigations revealed an interesting facet of mutations through recombination. The role of recombination in viral sequence changes is hotly debated (Hao 2011; Boni et al. 2012), the general opinion being that if recombination does take place in RNA viruses at all through the copy-choice method, it would be below 2%. We enquired into the possibility of another style of recombination, complete segments of a gene being exchanged through polymerase jumps at the segment boundaries: the neuraminidase gene with three segments – transmembrane, stalk and body – is a good example. Taking A/chicken/Afghanistan/1573–65/2006(H5N1)NA as a test case (Ghosh et al. 2009) and computing g\n values for the three segments individually, we compared each segment with corresponding segments of a selected group of H5N1 neuraminidase genes in terms of the g\n values. We found that the g\n value for the transmembrane segment of this strain was identical, for example, with the g\n value of the transmembrane segment of A/turkey/Islamabad/NARC7873/2007(H5N1)NA, i.e. they have the exact same sequence, implying a segment exchange had taken place at some time. Similarly, the stalk segment was found identical in the test sample and in A/greatcrestedgrebe/Denmark/ 7498/06(H5N1)NA, and the body was found to have been duplicated in A/turkey/Islamabad-Pakistan/NARC-7871/02/2007(H5N1)NA, which implies that recombination-like events through exchanges of individual segments do take place (Ghosh et al. 2009).\n        "}, {"section": "Characterising the Flu Using Graphical Representation Methods", "text": "To understand the extent of this phenomenon, we undertook a detailed survey of the hemagglutinin protein that is comparatively simpler in that it has two segments designated HA1 and HA2. Our study (De et al. 2016) involved a total of 1274 HA sequences comprised of H1N1, H3N2, H5N1 and H7N9 subtypes from Asia over the period 2010–2014. In this database we searched for sets of three strains where a HA1 from one strain and a HA2 from a different strain would combine to form a third, daughter strain (see schematic, Fig. 9.11). This was easily accomplished by computing g\n values for each segment for all the strains and comparing to find duplicates, with the proviso that the two parental strains were from the same time and place. We found a total of 73 daughter strains, but, interestingly, there were no exchanges between different subtypes of the hemagglutinin. The daughter strains comprised 16 out of 427 H1 subtype, 30 of 408 H3 subtype, 20 of 350 H5 subtype and 7 of 89 H7 subtype in our database totalling 5.73% of all the strains in the database. Extending the analysis to 102 new strains from 2015 yielded another 5 instances of segment-wise recombination-like events. Thus, while the evidence for copy-choice recombination event mosaic in any gene sequence may not be readily evident, segment-wise recombination-like events do appear to occur in around 5% instances.\n\n        "}, {"section": "", "text": "\nSchematic of segment-wise recombination hypothesised for hemagglutinin. (Reproduced from Fig. 2 of De et al. (2016))"}, {"section": "Characterising the Flu Using Graphical Representation Methods", "text": "The two surface proteins, hemagglutinin and neuraminidase, have more in common: It appears that there is some kind of correlation between the two proteins such that suppression of the role of one influences changes in the sequence of the other and that coadaptation between the two was required for initiation of the H1N1 pandemic of 2009 (Wei 2010; Wagner et al. 2002; Xu et al. 2012; Hooper and Bloom 2013). There was also an observation that the influenza over the years had shown only a few subtypes instead of large numbers possible from the existence of 18 HA and 11 NA subtypes. Clearly, there was some interdependence between the two proteins, but there was no idea of what and how strong the interdependence could be. We undertook a study through graphical representation method (Nandy et al. 2014) and hypothesised a coupling between the HA and NA nucleotide sequences which could be measured through the g\n values. We assumed that subtypes that exist would have strong coupling and subtypes that are not found in nature would be weakly coupled, i.e. their interdependence would be weak, and hence those strains would not survive in nature. Our results (Nandy et al. 2014) amply bore this out and in fact showed that the couplings were stronger for avian flus compared to human-infecting flus, which one would have expected since wild birds seem to be the reservoir of influenza viruses of different kinds. We carried this analysis further and forecast the effects of possible reassortments of the H5N2 virus affecting poultry in the USA for therapeutic development and surveillance purposes (Nandy and Basak 2015).\n        "}, {"section": "Characterising the Flu Using Graphical Representation Methods", "text": "As is evident from the above applications, g\n is a convenient way to scan hundreds and thousands of sequences in a short time interval to determine segments of interest. One particularly important query is identifying conserved segments in any gene sequence. By scanning the relevant sequences through a window of the appropriate size and determining the number of instances where the g\n values remain identical, the best conserved segments of a gene sequence can be identified. Correspondingly, taking the protein sequence and computing the p\n values in the 20D model (see Sect. 9.2.3.2), the conserved domains in the protein can be identified. These techniques are an important tool in rational design of peptide vaccines where we may target those peptides that are conserved and have the capability of appropriate immune response to be the basis for vaccines that can outlive several generations of mutational changes. We had followed this procedure to identify best target sites in the NA of H5N1 (Ghosh et al. 2010) and the HA of H7N9 (Sarkar et al. 2015) influenza subtypes. Analyses for these targets are described briefly in the next section.\n      "}, {"section": "Drugs and Vaccines Against the Flu and Vaccine Design by Graphical Method", "text": "As in the case of most RNA viruses, drugs and vaccines against the influenza virus also face rapid obsolescence due to the high level of mutational changes. There have been several drugs that have been developed against the influenza, but only one remains effective at this time, while vaccines have to be changed every year.\n        "}, {"section": "Drugs and Vaccines Against the Flu and Vaccine Design by Graphical Method", "text": "Drugs used in influenza treatment globally belong to two groups having distinctive pharmacological attributes: M2 ion channel blockers and NA (neuraminidase) inhibitors (Stiver 2003). M2 protein forms a small proton channel across the viral envelope and mediates pH levels across viral membrane during cell entry and progeny maturation (Pielak and Chou 2011). It is vital for viral replication, and drugs amantadine and rimantadine were developed to block its function but has since been withdrawn because mutational changes in the prevailing influenzas have rendered them resistant to these drugs (CDC 2011). Present drugs available in the market are neuraminidase inhibitors are peramivir (trade name Rapivab), zanamivir (trade name Relenza) and oseltamivir (trade name Tamiflu). The neuraminidase inhibitors act both against IAV and IBV. However, according to the World Health Organisation (WHO), there is widespread resistance against oseltamivir globally (WHO 2009).\n        "}, {"section": "Drugs and Vaccines Against the Flu and Vaccine Design by Graphical Method", "text": "Vaccines that prepare the body’s immune system against foreign pathogens form an alternative to drugs in the fight against viral diseases. Vaccines may be live-attenuated, inactivated or recombinant virus-like particle (VLP) type. With influenza there are so many different strains that finding a traditional vaccine against all types poses a perennial problem. Based on global surveillance data generated by WHO’s in-house surveillance system, viz. the Global Influenza Surveillance and Response System (GISRS), vaccine strains are chosen for every year on the basis of preponderance of viral strains in each hemisphere. At present, for 2017–2018, WHO recommended four A and B strains, viz. A/Michigan/45/2015 (H1N1) pdm09-like virus, A/Hong Kong/4801/2014(H3N2)-like virus, B/Brisbane/60/2008-like virus (Victoria lineage) and B/Phuket/3073-like virus (Yamagata lineage), to be used as quadrivalent vaccine in the northern hemisphere (WHO 2017). The CDC also recommends vaccines for a year based on their assessment of prevailing virus strains in the previous year. While these do reduce the scope of the infection, in some years the vaccine is only partly effective as in 2014–2015 season and again in the current year, i.e. 2017–2018. These are partly due to the continuing mutations in the viral strains and partly errors in the vaccine as is reported to have happened this year.\n        "}, {"section": "Drugs and Vaccines Against the Flu and Vaccine Design by Graphical Method", "text": "It has therefore been a lingering quest to develop a universal flu vaccine that could act against all strains of the virus all the time. There have been claims off and on of a universal flu vaccine, but to date no such vaccine has been marketed. We undertook a graphical and numerical analyses of 514 strains of the H5N1 and 425 strains of the H1N1 influenza virus neuraminidase gene and determined six regions which remained conserved (Ghosh et al. 2010). This was facilitated by our examination of the graphical representation of the neuraminidase gene sequence which showed a strongly conserved 50/51 base (17 aa) region near the 3′ end of the gene. When examined in the 3D crystallographic structure of the protein, this region was seen to be responsible for the bonding between the adjacent proteins in the neuraminidase quaternary structure and therefore extremely important for the structure’s stability. The other regions we identified as being conserved also turned out to be surface exposed. These observations indicated a possibility, albeit subject to experimental verification, of designing inhibitors for broad-spectrum pandemic control of flu viruses with similar NA structure that could remain active for many generations of mutations of the underlying neuraminidase gene sequences (Ghosh et al. 2010). In another exercise, we explored the HA protein of H7N9 influenza virus using an improved protocol since there were concerns that the H7N9 could mutate to a human-infecting virus. We determined several targets in both the HA1 and HA2 regions of the hemagglutinin that could be used for rational design of peptide vaccines (Sarkar et al. 2015). It is to be noted that the HA1 of the hemagglutinin is highly variable, but HA2 is comparatively much more stable and is one of the targeted regions for a universal flu vaccine.\n        "}, {"section": "Drugs and Vaccines Against the Flu and Vaccine Design by Graphical Method", "text": "Another approach has recently been advocated for vaccine development. One of the disadvantages of current vaccines is their instability and weakness towards protease activity which mandates additional operational and transport costs; it also results in reduced biological activity and bioavailability to the immune system. Mile et al. (2018) constructed a T-cell-restricted IAV synthetic peptide containing D-amino subunits. D-amino acids are rarely found in nature and are inherently protected from protease degradation. Peptide was able to elicit an immune response in mice after oral administration. Such synthetic ‘mimics’ can be a cost-effective alternative to traditional vaccines.\n      "}, {"section": "Background", "text": "With the high rate of mutations in influenza genome along with the high frequency and intensity of influenza epidemics and pandemics recurring every few years, surveillance of influenza genomic variations is an important issue for monitoring its changes and designing drugs and vaccines. Using influenza, hepatitis, poliomyelitis and malaria as examples, Alexander Langmuir expounded disease surveillance as the constant vigilance over the patterns and spread of disease occurrence via accumulation, integration, assessment and interpretation of data on morbidity and mortality along with other parameters and relevant information (Langmuir 1963). The Centers for Disease Control and Prevention (CDC) outlines surveillance to encompass identification of health problems for surveillance; collection, analysis and interpretation of data; dissemination of the data and its interpretations; and evaluation and improvement of surveillance (CDC 2006).\n        "}, {"section": "Background", "text": "Surveillance of infectious viral diseases necessitates the analysis of antigenic constitutions of human-infecting viruses, as well as of viruses that belong to the same group which have not yet escaped their respective sylvatic cycles, in order to ascertain whether the molecular modifications have significantly altered known antigenic characteristics (Ghendon 1991). Some of the methods employed in viral discovery and analysis include tissue culture studies, immunohistochemical assays, singleplex and multiplex assays, serology and high-throughput sequencing (Lipkin and Firth 2013). One of the primary applications of disease surveillance and analysis is in the development of drugs and vaccines. The antigenic differences in the existing vaccine and the viral strains in circulation call for the synthesis of appropriate vaccine compositions to establish renewed immunity in the host population against epidemic- and pandemic-causing viruses (Smith et al. 2004). For surveillance of influenza, the Influenza Division at CDC collects specimens from over one million patients USA-wide which then follows a protocol for testing of the patient samples in various laboratories, followed by gene sequencing on approximately 6000 influenza viruses annually. Out of the pool of 6000 viruses, antigenic compositions are analysed in 2000 of them. The hemagglutination inhibition (HI) assay is used to identify the subtype of the hemagglutinin (HA) gene of a new influenza isolate on the basis of inhibition of hemagglutination by subtype-specific antibodies (Pedersen 2014). About 50 virus variants are filtered annually for potential vaccine production.\n      "}, {"section": "Application of Graphical Representation-Based Descriptors in Surveillance of Emerging Pathogens", "text": "Mathematical model analyses can extend the HI assays by quantitative estimation of antigenic differences; the results can also be reproduced visually to compare many strains at a time and check out significant differences. Examination of a number of plots of the influenza H5N1 neuraminidase gene in a 2D graphical representation system (Nandy 1994) led to the discovery of a 50-base segment at the 3′ end that was very strongly conserved (Nandy et al. 2007) and led eventually to a proposal for design of a peptide vaccine (Ghosh et al. 2010). This was found to be applicable across multiple subtypes of influenza, including H5N1, H1N1, H7N1, H9N1, H10N1 and others.\n        "}, {"section": "Application of Graphical Representation-Based Descriptors in Surveillance of Emerging Pathogens", "text": "That same work (Nandy et al. 2007) showed another facet of viral surveillance. As described in some detail in Sect. 9.3.3, for this study 173 strains of the H5N1 of the period 1996–2005 were grouped on the basis of pathogenic years in the human population, two denoting periods of human infections and another representing the absence of human cases. Significant differences in the g\n were observed between the two groups of strains. The observed differences implied that genetic drifts had occurred among the strains of the two periods with the mutations having led to a quantitative decrease in the hydrophobicity of the proteins of strains belonging to the infective period. This paper illustrated that a relatively simple mathematical metric, viz. g\n, can be related to the location and effects of mutations in RNA, sort through conserved regions in the RNA, compute similarity between multiple sequences and thus aid in the surveillance of changes in the viral genomes.\n        "}, {"section": "Application of Graphical Representation-Based Descriptors in Surveillance of Emerging Pathogens", "text": "Graphical representation can also help us understand the collected data which might contain incomplete information and annotation. Partial coding sequences can be graphically analysed to determine which part of the whole gene it belongs to through an alignment-free model. The approximate location of the sequence fragment can be determined in the gene by inferences from the nucleotide distribution pattern and the quantification of the pattern in form of g\n values. In their study of the Zika envelope gene, Dey et al. (2017a) evaluated partial CDS fragments and pinpointed their nucleotide start and end positions within the whole envelope gene sequence. Moreover, by cross-checking with existing annotated complete gene sequences, they were also able to identify additional peptide fragments in their sample sequences which contributed to the genetic differences between sequences collected from two different locations, Uganda and Brazil.\n        "}, {"section": "Application of Graphical Representation-Based Descriptors in Surveillance of Emerging Pathogens", "text": "Extending the feature of determining sequence similarity from g\n values, which directly correlate with the nucleotide distribution in gene sequences, the graphical method can also be specifically employed to deduce the mixing between viruses originating from different regions due to homologous recombination. This is significant in understanding the geographical dispersal and trend of viral strain and subtype circulation, a key point in surveillance study of disease spread. A study (De et al. 2016) of the hemagglutinin (HA) gene of H1N1, H5N1, H3N2 and H7N9 subtypes from Asia, spanning the years from 2010 to 2014, showed that there were homologous recombinations of whole segments between the same subtypes. Some instances indicated that the parental and progeny strains were from same geographic regions, while others showed unexpected regional disparity, for example, parental H1N1 strains were found to be from Kowloon and Guangdong in China, and the daughter strain was isolated in Singapore. These genomic trails can be used to glean movement patterns of pathogenic viruses. In another study (Ghosh et al. 2009), it was found that H5N1 strains in geese from Qinghai, China, were also observed 5000 km away in strains in swans from Southern Russia in 2005; H5N1 strains were detected in poultry in Turkey that were also observed in chicken in Israel, via the trade route; and the same H5N1 strain were found in Egypt and Ghana, while H5N1 samples collected in 2006 from ducks in Hunan had the same sequence as found in human samples isolated from Indonesia.\n        "}, {"section": "Application of Graphical Representation-Based Descriptors in Surveillance of Emerging Pathogens", "text": "Another important utility of the graphical representations is inferring the lineage of the strains. The g\n can be used to generate non-alignment-based phylogenetic trees that can indicate the evolutionary relationships between the viruses (Liao et al. 2005, 2006). Its application has also established new insights about virus families, exemplified by dengue type 2 virus (DENV2) which belongs to the flavivirus family along with Zika virus, yellow fever virus, West Nile virus and Japanese encephalitis virus, among others. The envelope gene sequences of DENV2 greatly deviate from the other aforementioned flaviviruses in their nucleotide distribution and composition. This was a new find compared to available literature which has classified dengue to be similar to the other flavivirus members. The change in their g\n values is significant (Dey et al. 2017b). This type of analytical observation will aid in surveillance of pathogens for antiviral and vaccine development.\n        "}, {"section": "Application of Graphical Representation-Based Descriptors in Surveillance of Emerging Pathogens", "text": "These observations show the role of descriptors g\n in the surveillance of viruses. Earlier in the chapter, we described methods for calculation of other sequence descriptors. Different descriptors may encode different structural information on the sequences. So, a collection of sequence descriptors or orthogonal factors like principal components (PCs) derived from them may be more powerful tools for the comparison and surveillance of emerging viral pathogenesis. Such a critical analysis of different methodologies was done by us some time ago (Sen et al. 2016) and will be further developed and implemented in other areas.\n      "}, {"section": "Big Data and Social Networks in Surveillance Programmes", "text": "Dr. Tarun Weeramanthri introduced the term precision public health (Severi et al. 2014) and is now defined as the usage of computational and technological progress and big data to improve disease surveillance (Dolley 2018). The primary goal of precision public health is the accuracy involved in gathering data including emerging pathogens, reactions based on susceptibility and geographical distribution of the diseases. It makes use of real-time data generated, among other computational methods, to gather quick observable data. Traditional methods of forecasting influenza trends by CDC usually lag behind real time by 1–2 weeks, whereas information contained in cloud-based electronic health records and search queries in the Internet are typically available near real time. Yang et al. (2017) combine these cloud-based records and Internet searches with historical flu data and use dynamically selected set of variables to give the best fit in their model for the 2013–2016 flu season. Their results correctly estimated the peak timing and magnitude of the studies of flu season. These kinds of predictive models of influenza activity help public health officials prepare and allocate resources for possible disease outbreaks.\n        "}, {"section": "Big Data and Social Networks in Surveillance Programmes", "text": "However, as with any individual’s information, the use of public data calls for discretion: consent, privacy and security must be upheld and protected. Furthermore, an application that has come into prominence is the use of millions of data available from the social media platforms on the World Wide Web. However, the risk of inaccuracy in predictive analysis based on such data is high. A wide margin of error is required to compensate for over- or underestimation. Google Flu Trends, which is the recent surveillance tracking arm of the search engine giant, came into the spotlight for over-calculating the doctor visits for influenza-like illness than the reports generated by CDC which relies on records procured from laboratories (Lazer et al. 2014). The idea was to correlate search criteria with flu incidence and establish a trend. The initial trials matched 50 million searches with 1152 data points (Ginsberg et al. 2009) and came out with erroneous results due to certain ad hoc procedures. Even after corrections to the programmes, GFT persistently overestimated flu prevalence and has been relegated to the background for now in favour of more traditional procedures as adopted, for example, by CDC. Ideally, perhaps a combination of the two approaches could auger for better predictive trend analyses.\n      "}, {"section": "Ethics in Surveillance", "text": "With any scientific research, one must take into account the ethical implications of their work and inferences. A bone of contention in the prevention of spread of avian influenza and possible epidemics in human population is the recent trend in culling of poultry birds suspected to be infected by the H5N1 and H7N9 avian flu. The ethical dilemma arises between the prices of avian life against human population safety. Furthermore, WHO sheds light on the risks which the healthcare professionals place themselves in and also illuminates on the extent of travel restrictions that can be imposed in order to mitigate the spread of disease and the individual rights to freedom of movement. In 2006, WHO published a manual to integrate ethics with the influenza pandemic response structure (WHO 2007). The guide advocates sharing of surveillance information across borders during the pandemic, as well as prior and post pandemic. Resnik (2013) talks about the dilemma faced with the morality of dissemination of scientific knowledge, exemplified by the two censored and redacted papers, authored by Kawaoka and Fouchier Enserink 2012). Their papers showed the conclusions of genetically inducing mutations in H5N1 that conferred onto the viruses the ability to transmit through air among ferrets in the form of respiratory water droplets. The authors asserted that similar conditions among human populations would produce similar results. The NSABB, National Science Advisory Board for Biosecurity, allowed revised and heavily edited versions of the papers to be published in fear of dual-use research concerns (DURC) where scientific findings can be used for catastrophic implications. The NSABB, after much deliberation, recommended the full publication of their work.\n      "}, {"section": "Summary", "text": "In this chapter we have outlined powerful and novel alignment-free graphical representation and numerical characterisation (GRANCH) tools for comparative analyses of biomolecular sequences. We explained in brief some of the proposals put forward for graphical representation and numerical characterisation in various dimensionalities and mentioned some of the many applications done using these novel, alignment-free approaches. In particular, we concentrated upon several applications done through the simple and intuitive 2D graphical representation of Nandy (1994) to give an idea of how these approaches can be utilised to compare and contrast the several variants of the influenza virus, determine homologous recombinations between strains of the same influenza subtype, identify conserved segments in influenza gene sequences and design peptide vaccines. We have seen that these approaches can yield phylogenetic trees to understand the relationships between the various strains and subtypes and assist in focused surveillance to ensure advance knowledge of developments that could lead to epidemic and pandemic varieties. Graphical representation and numerical characterisation thus are very general but quantitative approaches that can be used to unravel myriad aspects of viral characteristics.\n    "}], "ref_list": [{"ref_id": "CR1", "pmid_cited": "19296677", "doi_cited": "", "ref_title": "Alignment-free prediction of polygalacturonases with pseudofolding topological indices: experimental isolation from coffea arabica and prediction of a new sequence", "ref_auth": "G Aguero-Chapin; J Varona-Santos; GA de la Riva; A Antunes; T Gonzalez-Villa; E Uriarte", "ref_year": "2009", "ref_jrnal": "J Proteome Res"}, {"ref_id": "CR2", "pmid_cited": "2231712", "doi_cited": "", "ref_title": "Basic local alignment search tool", "ref_auth": "SF Altschul; W Gish; W Miller; EW Myers; DJ Lipman", "ref_year": "1990", "ref_jrnal": "J Mol Biol"}, {"ref_id": "CR3", "pmid_cited": "9254694", "doi_cited": "", "ref_title": "Gapped BLAST and PSI-BLAST: a new generation of protein database search programs", "ref_auth": "SF Altschul; TL Madden; AA Schaffer; J Zhang; Z Zhang; W Miller; ", "ref_year": "1997", "ref_jrnal": "Nucleic Acids Res"}, {"ref_id": "CR02", "pmid_cited": "16494503", "doi_cited": "", "ref_title": "On Graphical and Numerical Representation of Protein Sequences", "ref_auth": "Fenglan Bai; Tianming Wang", "ref_year": "2006", "ref_jrnal": "Journal of Biomolecular Structure and Dynamics"}, {"ref_id": "CR4", "pmid_cited": "20335491", "doi_cited": "", "ref_title": "How RNA viruses maintain their genome integrity", "ref_auth": "JN Barr; R Fearns", "ref_year": "2010", "ref_jrnal": "J Gen Virol"}, {"ref_id": "CR5", "pmid_cited": "6282993", "doi_cited": "", "ref_title": "Survival of influenza viruses on environmental surfaces", "ref_auth": "B Bean; BM Moore; B Sterner; LR Peterson; DN Gerding; HH Balfour", "ref_year": "1982", "ref_jrnal": "J Infect Dis"}, {"ref_id": "CR7", "pmid_cited": "", "doi_cited": "10.1016/j.cplett.2007.05.050", "ref_title": "2D-dynamic representation of DNA sequences", "ref_auth": "D Bielinska-Waz; T Clark; P Waz; W Nowak; A Nandy", "ref_year": "2007", "ref_jrnal": "Chem Phys Lett"}, {"ref_id": "CR8", "pmid_cited": "22226809", "doi_cited": "", "ref_title": "No evidence for intrasegment recombination of 2009 H1N1 influenza virus in swine", "ref_auth": "MF Boni; GJ Smith; EC Holmes; D Vijaykrishna", "ref_year": "2012", "ref_jrnal": "Gene"}, {"ref_id": "CR9", "pmid_cited": "19230160", "doi_cited": "", "ref_title": "The biology of influenza viruses", "ref_auth": "Nicole M. Bouvier; Peter Palese", "ref_year": "2008", "ref_jrnal": "Vaccine"}, {"ref_id": "CR10", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR11", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR12", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR13", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR14", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR15", "pmid_cited": "23365425", "doi_cited": "", "ref_title": "Structural analysis of the evolutionary origins of influenza virus hemagglutinin and other viral lectins", "ref_auth": "L Chen; F Li", "ref_year": "2013", "ref_jrnal": "J Virol"}, {"ref_id": "CR16", "pmid_cited": "4358939", "doi_cited": "", "ref_title": "Conformational parameters for amino acids in helical, beta-sheet, and random coil regions calculated from proteins", "ref_auth": "PY Chou; GD Fasman", "ref_year": "1974", "ref_jrnal": "Biochemistry"}, {"ref_id": "CR17", "pmid_cited": "4358940", "doi_cited": "", "ref_title": "Prediction of protein conformation", "ref_auth": "PY Chou; GD Fasman", "ref_year": "1974", "ref_jrnal": "Biochemistry"}, {"ref_id": "CR18", "pmid_cited": "18257557", "doi_cited": "", "ref_title": "3D-MEDNEs: an alternative “in silico” technique for chemical research in toxicology. 2. Quantitative proteome-toxicity relationships (QPTR) based on mass Spectrum spiral entropy", "ref_auth": "M Cruz-Monteagudo; H González-Díaz; F Borges; ER Dominguez; MN Cordeiro", "ref_year": "2008", "ref_jrnal": "Chem Res Toxicol"}, {"ref_id": "CR013", "pmid_cited": "22738893", "doi_cited": "", "ref_title": "Estimated global mortality associated with the first 12 months of 2009 pandemic influenza A H1N1 virus circulation: a modelling study", "ref_auth": "Fatimah S Dawood; A Danielle Iuliano; Carrie Reed; Martin I Meltzer; David K Shay; Po-Yung Cheng; Don Bandaranayake; Robert F Breiman; W Abdullah Brooks; Philippe Buchy; Daniel R Feikin; Karen B Fowler; Aubree Gordon; Nguyen Tran Hien; Peter Horby; Q Sue Huang; Mark A Katz; Anand Krishnan; Renu Lal; Joel M Montgomery; Kåre Mølbak; Richard Pebody; Anne M Presanis; Hugo Razuri; Anneke Steens; Yeny O Tinoco; Jacco Wallinga; Hongjie Yu; Sirenda Vong; Joseph Bresee; Marc-Alain Widdowson", "ref_year": "2012", "ref_jrnal": "The Lancet Infectious Diseases"}, {"ref_id": "CR014", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR19", "pmid_cited": "", "doi_cited": "10.2741/s502", "ref_title": "Molecular evolution of hemagglutinin gene of influenza a virus", "ref_auth": "A De", "ref_year": "2018", "ref_jrnal": "Front Biosci (Schol Ed)"}, {"ref_id": "CR012", "pmid_cited": "9335492", "doi_cited": "", "ref_title": "", "ref_auth": "J. C. de Jong; E. C. J. Claas; A. D. M. E. Osterhaus; R. G. Webster; W. L. Lim", "ref_year": "1997", "ref_jrnal": "Nature"}, {"ref_id": "CR20", "pmid_cited": "27083561", "doi_cited": "", "ref_title": "Bioinformatics studies of influenza a hemagglutinin sequence data indicate recombination-like events leading to segment exchanges", "ref_auth": "A De; T Sarkar; A Nandy", "ref_year": "2016", "ref_jrnal": "BMC Res Notes"}, {"ref_id": "CR21", "pmid_cited": "", "doi_cited": "10.4137/CIN.S39071", "ref_title": "Rational design of peptide vaccines against multiple types of human papillomavirus", "ref_auth": "S Dey; A De; A Nandy", "ref_year": "2016", "ref_jrnal": "Cancer Informat"}, {"ref_id": "CR22", "pmid_cited": "28342423", "doi_cited": "", "ref_title": "A bioinformatics approach to designing a Zika virus vaccine", "ref_auth": "S Dey; A Nandy; SC Basak; P Nandy; S Das", "ref_year": "2017", "ref_jrnal": "Comput Biol Chem"}, {"ref_id": "CR23", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR24", "pmid_cited": "10988018", "doi_cited": "", "ref_title": "Fourier and wavelet transform analysis, a tool for visualizing regular patterns in DNA sequences", "ref_auth": "G Dodin; P Vandergheynst; P Levoir; C Cordier; L Marcourt", "ref_year": "2000", "ref_jrnal": "J Theor Biol"}, {"ref_id": "CR25", "pmid_cited": "29594091", "doi_cited": "", "ref_title": "Big Data’s role in precision public health", "ref_auth": "S Dolley", "ref_year": "2018", "ref_jrnal": "Front Public Health"}, {"ref_id": "CR26", "pmid_cited": "8387212", "doi_cited": "", "ref_title": "Rates of spontaneous mutation among RNA viruses", "ref_auth": "JW Drake", "ref_year": "1993", "ref_jrnal": "Proc Natl Acad Sci USA"}, {"ref_id": "CR28", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR010", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR29", "pmid_cited": "11562286", "doi_cited": "", "ref_title": "Recent Advances on the Role of Topological Indices in Drug Discovery Research", "ref_auth": "Ernesto Estrada; Eugenio Uriarte", "ref_year": "2001", "ref_jrnal": "Current Medicinal Chemistry"}, {"ref_id": "CR31", "pmid_cited": "23577628", "doi_cited": "", "ref_title": "Human infection with a novel avian-origin influenza A (H7N9) virus", "ref_auth": "R Gao; B Cao; Y Hu; Z Feng; D Wang; W Hu; ", "ref_year": "2013", "ref_jrnal": "N Engl J Med"}, {"ref_id": "CR32", "pmid_cited": "", "doi_cited": "10.1016/S0022-5193(86)80144-8", "ref_title": "A simple way to look at DNA", "ref_auth": "MA Gates", "ref_year": "1986", "ref_jrnal": "J Theor Biol"}, {"ref_id": "CR34", "pmid_cited": "1720356", "doi_cited": "", "ref_title": "Influenza surveillance", "ref_auth": "Y Ghendon", "ref_year": "1991", "ref_jrnal": "Bull World Health Organ"}, {"ref_id": "CR35", "pmid_cited": "19778054", "doi_cited": "", "ref_title": "Computational study of dispersion and extent of mutated and duplicated sequences of the H5N1 influenza neuraminidase over the period 1997− 2008", "ref_auth": "A Ghosh; A Nandy; P Nandy; BD Gute; SC Basak", "ref_year": "2009", "ref_jrnal": "J Chem Inf Model"}, {"ref_id": "CR36", "pmid_cited": "20170556", "doi_cited": "", "ref_title": "Computational analysis and determination of a highly conserved surface exposed segment in H5N1 avian flu and H1N1 swine flu neuraminidase", "ref_auth": "Ambarnil Ghosh; Ashesh Nandy; Papiya Nandy", "ref_year": "2010", "ref_jrnal": "BMC Structural Biology"}, {"ref_id": "CR37", "pmid_cited": "22844409", "doi_cited": "", "ref_title": "In silico study of rotavirus VP7 surface accessible conserved regions for antiviral drug/vaccine design", "ref_auth": "A Ghosh; S Chattopadhyay; M Chawla-Sarkar; P Nandy; A Nandy", "ref_year": "2012", "ref_jrnal": "PLoS One"}, {"ref_id": "CR38", "pmid_cited": "5456129", "doi_cited": "", "ref_title": "The diagram, a method for comparing sequences. Its use with amino acid and nucleotide sequences", "ref_auth": "AJ Gibbs; GA McIntyre", "ref_year": "1970", "ref_jrnal": "Eur J Biochem"}, {"ref_id": "CR39", "pmid_cited": "19020500", "doi_cited": "", "ref_title": "Detecting influenza epidemics using search engine query data", "ref_auth": "J Ginsberg; ", "ref_year": "2009", "ref_jrnal": "Nature"}, {"ref_id": "CR40", "pmid_cited": "", "doi_cited": "10.2174/156802607780906771", "ref_title": "Medicinal chemistry and bioinformatics - current trends in drugs discovery with networks topological indices", "ref_auth": "H González-Díaz; S Vilar; L Santana; E Uriarte", "ref_year": "2007", "ref_jrnal": "Curr Top Med Chem"}, {"ref_id": "CR41", "pmid_cited": "18297652", "doi_cited": "", "ref_title": "Proteomics, networks and connectivity indices", "ref_auth": "H Gonzalez-Diaz; Y González-Díaz; L Santana; FM Ubeira; E Uriarte", "ref_year": "2008", "ref_jrnal": "Proteomics"}, {"ref_id": "CR42", "pmid_cited": "19075774", "doi_cited": "", "ref_title": "Predicting antimicrobial drugs and targets with the MARCH-INSIDE approach", "ref_auth": "H Gonzalez-Diaz; F Prado-Prado; FM Ubeira", "ref_year": "2008", "ref_jrnal": "Curr Top Med Chem"}, {"ref_id": "CR45", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR46", "pmid_cited": "21571048", "doi_cited": "", "ref_title": "Evidence of intra-segmental homologous recombination in influenza A virus", "ref_auth": "W Hao", "ref_year": "2011", "ref_jrnal": "Gene"}, {"ref_id": "CR47", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "F Harary", "ref_year": "1969", "ref_jrnal": "Graph theory"}, {"ref_id": "CR48", "pmid_cited": "24595369", "doi_cited": "", "ref_title": "Characterization of a novel influenza virus in cattle and swine: proposal for a new genus in the Orthomyxoviridae family", "ref_auth": "BM Hause; EA Collin; R Liu; B Huang; Z Sheng; W Lu; D Wang; EA Nelson; F Li", "ref_year": "2014", "ref_jrnal": "MBio"}, {"ref_id": "CR50", "pmid_cited": "24027333", "doi_cited": "", "ref_title": "A mutant influenza virus that uses an N1 neuraminidase as the receptor-binding protein", "ref_auth": "KA Hooper; JD Bloom", "ref_year": "2013", "ref_jrnal": "J Virol"}, {"ref_id": "CR51", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "D Janežič; A Miličević; S Nikolić; N Trinajstić", "ref_year": "2007", "ref_jrnal": "Graph theoretical matrices in chemistry"}, {"ref_id": "CR52", "pmid_cited": "", "doi_cited": "10.1007/s10910-006-9063-3", "ref_title": "TB-curve, a New 2-D Graphical Representation of DNA Sequences", "ref_auth": "Ming Ji; Chun Li", "ref_year": "2006", "ref_jrnal": "Journal of Mathematical Chemistry"}, {"ref_id": "CR53", "pmid_cited": "12136088", "doi_cited": "", "ref_title": "MAFFT: a novel method for rapid multiple sequence alignment based on fast Fourier transform", "ref_auth": "K Katoh; K Misawa; K Kuma; T Miyata", "ref_year": "2002", "ref_jrnal": "Nucleic Acids Res"}, {"ref_id": "CR05", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR54", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR55", "pmid_cited": "19453419", "doi_cited": "", "ref_title": "Sialic acid tissue distribution and influenza virus tropism", "ref_auth": "U Kumlin; S Olofson; K Dimock; N Arnberg", "ref_year": "2008", "ref_jrnal": "Influenza Other Respir Viruses"}, {"ref_id": "CR57", "pmid_cited": "13928666", "doi_cited": "", "ref_title": "The surveillance of communicable diseases of national importance", "ref_auth": "AD Langmuir", "ref_year": "1963", "ref_jrnal": "N Engl J Med"}, {"ref_id": "CR58", "pmid_cited": "18377056", "doi_cited": "", "ref_title": "Chromosome evolution with naked eye: palindromic context of the life origin", "ref_auth": "S Larionov; A Loskutov; E Ryadchenko", "ref_year": "2008", "ref_jrnal": "Chaos"}, {"ref_id": "CR59", "pmid_cited": "24626916", "doi_cited": "", "ref_title": "The parable of Google flu: traps in big data analysis", "ref_auth": "D Lazer; R Kennedy; G King; A Vespignani", "ref_year": "2014", "ref_jrnal": "Science"}, {"ref_id": "CR60", "pmid_cited": "8590173", "doi_cited": "", "ref_title": "Random walk and gap plots of DNA sequences", "ref_auth": "PM Leong; S Morgenthaler", "ref_year": "1995", "ref_jrnal": "Comput Appl Biosci"}, {"ref_id": "CR61", "pmid_cited": "", "doi_cited": "10.3390/app6030063", "ref_title": "Novel graphical representation and numerical characterization of DNA sequences", "ref_auth": "C Li; W Fei; Y Zhao; X Yu", "ref_year": "2016", "ref_jrnal": "Appl Sci"}, {"ref_id": "CR03", "pmid_cited": "15446824", "doi_cited": "", "ref_title": "Analysis of Similarity/Dissimilarity of DNA Sequences Based on Nonoverlapping Triplets of Nucleotide Bases", "ref_auth": "Bo Liao; Tian-ming Wang", "ref_year": "2004", "ref_jrnal": "Journal of Chemical Information and Computer Sciences"}, {"ref_id": "CR62", "pmid_cited": "", "doi_cited": "10.1016/j.tcs.2005.12.012", "ref_title": "A 3D graphical representation of DNA sequences and its application", "ref_auth": "B Liao; K Ding", "ref_year": "2006", "ref_jrnal": "Theo Comput Sc"}, {"ref_id": "CR63", "pmid_cited": "", "doi_cited": "10.1016/j.cplett.2005.08.079", "ref_title": "Application of 2-D graphical representation of DNA sequence", "ref_auth": "B Liao; M Tan; K Ding", "ref_year": "2005", "ref_jrnal": "Chem Phys Lett"}, {"ref_id": "CR64", "pmid_cited": "16752365", "doi_cited": "", "ref_title": "Coronavirus phylogeny based on 2D graphical representation of DNA sequence", "ref_auth": "B Liao; X Xiang; W Zhu", "ref_year": "2006", "ref_jrnal": "J Comput Chem"}, {"ref_id": "CR65", "pmid_cited": "23602435", "doi_cited": "", "ref_title": "Viral surveillance and discovery", "ref_auth": "WI Lipkin; C Firth", "ref_year": "2013", "ref_jrnal": "Curr Opin Virol"}, {"ref_id": "CR66", "pmid_cited": "23643111", "doi_cited": "", "ref_title": "Origin and diversity of novel avian influenza a H7N9 viruses causing human infection: phylogenetic, structural, and coalescent analyses", "ref_auth": "D Liu; W Shi; Y Shi; D Wang; H Xiao; W Li; Y Bi; ", "ref_year": "2013", "ref_jrnal": "Lancet"}, {"ref_id": "CR04", "pmid_cited": "16707055", "doi_cited": "", "ref_title": "2,500-year Evolution of the Term Epidemic", "ref_auth": "Paul M.V. Martin; Estelle Martin-Granel", "ref_year": "2006", "ref_jrnal": "Emerging Infectious Diseases"}, {"ref_id": "CR06", "pmid_cited": "21420659", "doi_cited": "", "ref_title": "Geography May Explain Adult Mortality from the 1918–20 Influenza Pandemic", "ref_auth": "Svenn-Erik Mamelund", "ref_year": "2011", "ref_jrnal": "Epidemics"}, {"ref_id": "CR68", "pmid_cited": "29293098", "doi_cited": "", "ref_title": "Peptide mimic for influenza vaccination using nonnatural combinatorial chemistry", "ref_auth": "JJ Mile; MP Tan; G Dolton; ESJ Edwards; G Sae; B Laugel; ", "ref_year": "2018", "ref_jrnal": "J Clin Invest"}, {"ref_id": "CR69", "pmid_cited": "20048675", "doi_cited": "", "ref_title": "The 1918 influenza pandemic: lessons for 2009 and the future", "ref_auth": "DM Morens; JK Taubenberger; HA Harvey; MJ Memoli", "ref_year": "2010", "ref_jrnal": "Crit Care Med"}, {"ref_id": "CR71", "pmid_cited": "", "doi_cited": "", "ref_title": "A new graphical representation and analysis of DNA sequence structure: I. Methodology and application to globin genes", "ref_auth": "A Nandy", "ref_year": "1994", "ref_jrnal": "Curr Sci"}, {"ref_id": "CR72", "pmid_cited": "", "doi_cited": "", "ref_title": "Graphical analysis of DNA sequence structure. III. Indications of evolutionary distinctions and characteristics of introns and exons", "ref_auth": "A Nandy", "ref_year": "1996", "ref_jrnal": "Curr Sci"}, {"ref_id": "CR73", "pmid_cited": "8670620", "doi_cited": "", "ref_title": "Two-dimensional graphical representation of DNA sequences and intron-exon discrimination in intron-rich sequences", "ref_auth": "A Nandy", "ref_year": "1996", "ref_jrnal": "CABIOS"}, {"ref_id": "CR75", "pmid_cited": "19714250", "doi_cited": "", "ref_title": "Empirical relationship between intra-purine and intra-pyrimidine differences in conserved gene sequences", "ref_auth": "A Nandy", "ref_year": "2009", "ref_jrnal": "PLoS One"}, {"ref_id": "CR76", "pmid_cited": "", "doi_cited": "10.2174/1573409911666150722122034", "ref_title": "Prognosis of possible Reassortments in recent H5N2 epidemic influenza in USA: implications for computer-assisted surveillance as well as drug/vaccine design", "ref_auth": "A Nandy; SC Basak", "ref_year": "2015", "ref_jrnal": "Curr Comp-Aided Drug Des"}, {"ref_id": "CR77", "pmid_cited": "", "doi_cited": "10.1016/S0009-2614(02)01830-4", "ref_title": "On the uniqueness of quantitative DNA difference descriptors in 2D graphical representation models", "ref_auth": "A Nandy; P Nandy", "ref_year": "2003", "ref_jrnal": "Chem Phys Lett"}, {"ref_id": "CR78", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR79", "pmid_cited": "17417832", "doi_cited": "", "ref_title": "Graphical representation and numerical characterization of H5N1 avian flu neuraminidase gene sequence", "ref_auth": "A Nandy; SC Basak; BD Gute", "ref_year": "2007", "ref_jrnal": "J Chem Inf Model"}, {"ref_id": "CR80", "pmid_cited": "19795567", "doi_cited": "", "ref_title": "Numerical characterization of protein sequences and application to voltage-gated sodium channel a subunit phylogeny", "ref_auth": "A Nandy; A Ghosh; P Nandy", "ref_year": "2009", "ref_jrnal": "In Silico Biol"}, {"ref_id": "CR81", "pmid_cited": "", "doi_cited": "10.2174/1573409911666150318203621", "ref_title": "Characteristics of influenza HA-NA interdependence determined through a graphical technique", "ref_auth": "A Nandy; T Sarkar; SC Basak; P Nandy; S Das", "ref_year": "2014", "ref_jrnal": "Curr Comp-Aided Drug Des"}, {"ref_id": "CR82", "pmid_cited": "5420325", "doi_cited": "", "ref_title": "A general method applicable to the search for similarities in the amino acid sequence of two proteins", "ref_auth": "SB Needleman; CD Wunsch", "ref_year": "1970", "ref_jrnal": "J Mol Biol"}, {"ref_id": "CR08", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR85", "pmid_cited": "24899416", "doi_cited": "", "ref_title": "Hemagglutination-inhibition assay for influenza virus subtype identification and the detection and quantitation of serum antibodies to influenza virus", "ref_auth": "JC Pedersen", "ref_year": "2014", "ref_jrnal": "Methods Mol Biol"}, {"ref_id": "CR86", "pmid_cited": "20451491", "doi_cited": "", "ref_title": "Influenza M2 proton channels", "ref_auth": "RM Pielak; JJ Chou", "ref_year": "2011", "ref_jrnal": "Biochim Biophys Acta"}, {"ref_id": "CR011", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR88", "pmid_cited": "", "doi_cited": "10.4137/EBO.S7364", "ref_title": "A novel model for DNA sequence similarity analysis based on graph theory", "ref_auth": "X Qi; Q Wu; Y Zhang; E Fuller; C-Q Zhang", "ref_year": "2011", "ref_jrnal": "Evol Bioinforma"}, {"ref_id": "CR89", "pmid_cited": "11045819", "doi_cited": "", "ref_title": "On 3-D graphical representation of DNA primary sequences and their numerical characterization", "ref_auth": "M Randic; M Vracko; A Nandy; SC Basak", "ref_year": "2000", "ref_jrnal": "J Chem Inf Comput Sci"}, {"ref_id": "CR90", "pmid_cited": "11045819", "doi_cited": "", "ref_title": "On 3-D representation of DNA primary sequences", "ref_auth": "M Randic; M Vracko; A Nandy; SC Basak", "ref_year": "2000", "ref_jrnal": "J Chem Inf Comput Sci"}, {"ref_id": "CR91", "pmid_cited": "", "doi_cited": "10.1016/S0009-2614(02)01784-0", "ref_title": "Novel 2-D graphical representation of DNA sequences and their numerical characterization", "ref_auth": "M Randic; M Vracko; N Lers; D Plavsic", "ref_year": "2003", "ref_jrnal": "Chem Phys Lett"}, {"ref_id": "CR01", "pmid_cited": "", "doi_cited": "10.1016/j.cplett.2004.08.118", "ref_title": "Unique graphical representation of protein sequences based on nucleotide triplet codons", "ref_auth": "Milan Randić; Jure Zupan; Alexandru T. Balaban", "ref_year": "2004", "ref_jrnal": "Chemical Physics Letters"}, {"ref_id": "CR92", "pmid_cited": "", "doi_cited": "10.1016/j.cplett.2005.03.086", "ref_title": "Four-color map representation of DNA or RNA sequences and their numerical characterization", "ref_auth": "M Randic; N Lers; D Plavsic; SC Basak; AT Balaban", "ref_year": "2005", "ref_jrnal": "Chem Phys Lett"}, {"ref_id": "CR93", "pmid_cited": "20939561", "doi_cited": "", "ref_title": "Graphical representation of proteins", "ref_auth": "M Randic; J Zupan; AT Balaban; V-T Drazen; D Plavsic", "ref_year": "2011", "ref_jrnal": "Chem Rev"}, {"ref_id": "CR94", "pmid_cited": "10192941", "doi_cited": "", "ref_title": "Indexing scheme and similarity measures for macromolecular sequences", "ref_auth": "C Raychaudhury; A Nandy", "ref_year": "1999", "ref_jrnal": "J Chem Inf Comput Sci"}, {"ref_id": "CR95", "pmid_cited": "9990079", "doi_cited": "", "ref_title": "Origin and evolution of the 1918 “Spanish” influenza virus hemagglutinin gene", "ref_auth": "AH Reid; TG Fanning; JV Hultin; JK Taubenberger", "ref_year": "1999", "ref_jrnal": "Proc Natl Acad Sci"}, {"ref_id": "CR96", "pmid_cited": "", "doi_cited": "10.3201/eid0910.020789", "ref_title": "1918 influenza pandemic caused by highly conserved viruses with two receptor-binding variants", "ref_auth": "AH Reid; TA Janczewski; AJ Elliot; RS Daniels; CL Berry; JS Oxford; JK Taubenberge", "ref_year": "2003", "ref_jrnal": "Emerg Infect Dis"}, {"ref_id": "CR97", "pmid_cited": "15494747", "doi_cited": "", "ref_title": "Evidence of an absence: the genetic origins of the 1918 pandemic influenza virus", "ref_auth": "AH Reid; JK Taubenberger; TG Fanning", "ref_year": "2004", "ref_jrnal": "Nat Rev Microbiol"}, {"ref_id": "CR98", "pmid_cited": "", "doi_cited": "10.1002/hast.143", "ref_title": "H5N1 avian flu RESEARCH and the ethics of KNOWLEDGE", "ref_auth": "DB Resnik", "ref_year": "2013", "ref_jrnal": "Hast Cent Rep"}, {"ref_id": "CR100", "pmid_cited": "26364271", "doi_cited": "", "ref_title": "H7N9 influenza outbreak in China 2013: in silico analyses of conserved segments of the hemagglutinin as a basis for the selection of peptide vaccine targets", "ref_auth": "T Sarkar; S Das; A De; P Nandy; S Chattopadhyay; M Chawla-Sarkar; A Nandy", "ref_year": "2015", "ref_jrnal": "Comput Biol Chem"}, {"ref_id": "CR101", "pmid_cited": "27222032", "doi_cited": "", "ref_title": "Intercorrelation of major DNA/RNA sequence descriptors–a preliminary study", "ref_auth": "D Sen; S Dasgupta; I Pal; S Manna; SC Basak; A Nandy; G Grunwald", "ref_year": "2016", "ref_jrnal": "Curr Comput Aided Drug Des"}, {"ref_id": "CR102", "pmid_cited": "", "doi_cited": "10.1007/s10549-014-3209-y", "ref_title": "Epigenome-wide methylation in DNA from peripheral blood as a marker of risk for breast cancer", "ref_auth": "G Severi; MC Southey; DR English; CH Jung; A Lonie; C McLean; ", "ref_year": "2014", "ref_jrnal": "Breast Cancer Res Treat"}, {"ref_id": "CR09", "pmid_cited": "9652423", "doi_cited": "", "ref_title": "Pandemic versus Epidemic Influenza Mortality: A Pattern of Changing Age Distribution", "ref_auth": "L. Simonsen; M. J. Clarke; L. B. Schonberger; N. H. Arden; N. J. Cox; K. Fukuda", "ref_year": "1998", "ref_jrnal": "Journal of Infectious Diseases"}, {"ref_id": "CR103", "pmid_cited": "7265238", "doi_cited": "", "ref_title": "Identification of common molecular subsequences", "ref_auth": "TF Smith; MS Waterman", "ref_year": "1981", "ref_jrnal": "J Mol Biol"}, {"ref_id": "CR104", "pmid_cited": "3871073", "doi_cited": "", "ref_title": "The statistical distribution of nucleic acid similarities", "ref_auth": "TF Smith; MS Waterman; C Burks", "ref_year": "1985", "ref_jrnal": "Nucleic Acids Res"}, {"ref_id": "CR105", "pmid_cited": "15218094", "doi_cited": "", "ref_title": "Mapping the antigenic and genetic evolution of influenza virus", "ref_auth": "DJ Smith; AS Lapedes; JC de Jong; TM Bestebroer; GF Rimmelzwaan; AD Osterhaus; RA Fouchier", "ref_year": "2004", "ref_jrnal": "Science"}, {"ref_id": "CR106", "pmid_cited": "15939477", "doi_cited": "", "ref_title": "A new 2-D graphical representation of DNA sequences and their numerical characterization", "ref_auth": "J Song; H Tang", "ref_year": "2005", "ref_jrnal": "J Biochem Biophys Methods"}, {"ref_id": "CR107", "pmid_cited": "27876034", "doi_cited": "", "ref_title": "H5N2 highly pathogenic avian influenza viruses from the US 2014–2015 outbreak have an unusually long pre-clinical period in turkeys", "ref_auth": "E Spackman; MJ Pantin-Jackwood; DR Kapczynski; DE Swayne; DL Suarez", "ref_year": "2016", "ref_jrnal": "BMC Vet Res"}, {"ref_id": "CR109", "pmid_cited": "12515786", "doi_cited": "", "ref_title": "The treatment of influenza with antiviral drugs", "ref_auth": "G Stiver", "ref_year": "2003", "ref_jrnal": "CMAJ"}, {"ref_id": "CR110", "pmid_cited": "9658115", "doi_cited": "", "ref_title": "Comparisons of highly virulent H5N1 influenza A virus isolated from humans and chickens from Hong Kong", "ref_auth": "DL Suarez; ML Perdue; N Cox; T Rowe; C Bender; J Huang; DE Swayne", "ref_year": "1998", "ref_jrnal": "J Virol"}, {"ref_id": "CR112", "pmid_cited": "", "doi_cited": "10.1007/s11434-010-0045-2", "ref_title": "On the similarity/dissimilarity of DNA sequences based on 4D graphical representation", "ref_auth": "XC Tang; PP Zhou; WY Qiu", "ref_year": "2010", "ref_jrnal": "Chin Sci Bull"}, {"ref_id": "CR07", "pmid_cited": "16494711", "doi_cited": "", "ref_title": "1918 Influenza: the Mother of All Pandemics", "ref_auth": "Jeffery K. Taubenberger; David M. Morens", "ref_year": "2006", "ref_jrnal": "Emerging Infectious Diseases"}, {"ref_id": "CR114", "pmid_cited": "24130481", "doi_cited": "", "ref_title": "New world bats harbor diverse influenza A viruses", "ref_auth": "S Tong; X Zhu; Y Li; M Shi; J Zhang; M Bourgeois; ", "ref_year": "2013", "ref_jrnal": "PLoS Pathog"}, {"ref_id": "CR116", "pmid_cited": "11987141", "doi_cited": "", "ref_title": "Functional balance between haemagglutinin and neuraminidase in influenza virus infections", "ref_auth": "R Wagner; M Matrosovich; HD Klenk", "ref_year": "2002", "ref_jrnal": "Rev Med Virol"}, {"ref_id": "CR117", "pmid_cited": "", "doi_cited": "10.1016/j.cplett.2006.03.030", "ref_title": "Characterization and similarity analysis of DNA sequences grounded on a 2-D graphical representation", "ref_auth": "J Wang; Y Zhang", "ref_year": "2006", "ref_jrnal": "Chem Phys Lett"}, {"ref_id": "CR118", "pmid_cited": "", "doi_cited": "10.4236/jbise.2010.31001", "ref_title": "The interaction between the 2009 H1N1 influenza a hemagglutinin and neuraminidase: mutations, co-mutations and the NA stalk motif", "ref_auth": "H Wei", "ref_year": "2010", "ref_jrnal": "J Biomed Sc Engg"}, {"ref_id": "CR119", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR121", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR122", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR123", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR124", "pmid_cited": "", "doi_cited": "10.1007/s10535-010-0062-7", "ref_title": "2D random walk representation of Begonia x_tuberhybrida multiallelic loci used for germplasm identification", "ref_auth": "I Wiesner; D Wiesnerova", "ref_year": "2010", "ref_jrnal": "Biol Plant"}, {"ref_id": "CR125", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR126", "pmid_cited": "22718832", "doi_cited": "", "ref_title": "Functional balance of the hemagglutinin and neuraminidase activities accompanies the emergence of the 2009 H1N1 influenza pandemic", "ref_auth": "R Xu; X Zhu; R McBride; CM Nycholat; W Yu; JC Paulson; IA Wilson", "ref_year": "2012", "ref_jrnal": "J Virol"}, {"ref_id": "CR127", "pmid_cited": "28482810", "doi_cited": "", "ref_title": "Using electronic health records and internet search information for accurate influenza forecasting", "ref_auth": "S Yang; M Santillana; JS Brownstein; J Gray; S Richardson; SC Kou", "ref_year": "2017", "ref_jrnal": "BMC Infect Dis"}, {"ref_id": "CR128", "pmid_cited": "", "doi_cited": "10.1016/j.theochem.2006.02.007", "ref_title": "A new 2D graphical representation—classification curve and the analysis of similarity/dissimilarity of DNA sequences", "ref_auth": "Y-h Yao; X-y Nan; T-m Wang", "ref_year": "2006", "ref_jrnal": "J Mol Struct THEOCHEM"}, {"ref_id": "CR129", "pmid_cited": "12799435", "doi_cited": "", "ref_title": "DNA sequence representation without degeneracy", "ref_auth": "SS-T Yau; J Wang; A Niknejad; C Lu; N Jin; Y-K Ho", "ref_year": "2003", "ref_jrnal": "Nucleic Acids Res"}, {"ref_id": "CR130", "pmid_cited": "24911780", "doi_cited": "", "ref_title": "A measure of DNA sequence similarity by Fourier transform with applications on hierarchical clustering", "ref_auth": "D Yin; Y Chen; S-T Yau", "ref_year": "2014", "ref_jrnal": "J Theor Biol"}, {"ref_id": "CR131", "pmid_cited": "", "doi_cited": "", "ref_title": "", "ref_auth": "", "ref_year": "", "ref_jrnal": ""}, {"ref_id": "CR132", "pmid_cited": "", "doi_cited": "10.14257/ijhit.2015.8.1.06", "ref_title": "Characterization and similarity analysis of DNA sequences considering codon degeneracy", "ref_auth": "Y-B Zhao; Z-H Qi; A-P Yang", "ref_year": "2015", "ref_jrnal": "Int J Hybrid Inf Technol"}]}